#pragma once

// Hawken (1.5.3.142579) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class OnlineSubsystemMeteor.OnlineAccountManager
// 0x0018 (0x0054 - 0x003C)
class UOnlineAccountManager : public UObject
{
public:
	class UOnlineSubsystemMeteor*                      MeteorOSS;                                                // 0x003C(0x0004) (Transient)
	struct FString                                     OnlineAccountObjectClassName;                             // 0x0040(0x000C) (Config, NeedCtorLink)
	class UOnlineAccountObject*                        LocalPlayerAccount;                                       // 0x004C(0x0004) (Const)
	class UOnlineAccountManagerDelegates*              Delegates;                                                // 0x0050(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineAccountManager");
		return ptr;
	}


	void ShutDown();
	void Init(class UOnlineSubsystem* OnlineSub);
};


// Class OnlineSubsystemMeteor.OnlineAccountManagerDelegates
// 0x0000 (0x003C - 0x003C)
class UOnlineAccountManagerDelegates : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineAccountManagerDelegates");
		return ptr;
	}

};


// Class OnlineSubsystemMeteor.OnlineAccountObject
// 0x00C4 (0x0100 - 0x003C)
class UOnlineAccountObject : public UObject
{
public:
	class UOnlineAccountManager*                       AccountManager;                                           // 0x003C(0x0004) (Const, Transient)
	TArray<struct FUniqueNetId>                        UnlockingAchievementIds;                                  // 0x0040(0x000C) (NeedCtorLink)
	struct FString                                     EmailAddress;                                             // 0x004C(0x000C) (Const, NeedCtorLink)
	struct FString                                     PlayerName;                                               // 0x0058(0x000C) (Const, NeedCtorLink)
	struct FString                                     SteamName;                                                // 0x0064(0x000C) (Const, NeedCtorLink)
	struct FUniqueNetId                                PlayerID;                                                 // 0x0070(0x0010) (Const)
	struct FUniqueNetId                                SteamID;                                                  // 0x0080(0x0010) (Const)
	TArray<struct FString>                             Roles;                                                    // 0x0090(0x000C) (Const, NeedCtorLink)
	int                                                FailedLoginAttempts;                                      // 0x009C(0x0004) (Const)
	struct FString                                     CreationTime;                                             // 0x00A0(0x000C) (Const, NeedCtorLink)
	struct FString                                     LastPasswordChangeTime;                                   // 0x00AC(0x000C) (Const, NeedCtorLink)
	struct FString                                     LastLoginTime;                                            // 0x00B8(0x000C) (Const, NeedCtorLink)
	struct FString                                     LastLogoutTime;                                           // 0x00C4(0x000C) (Const, NeedCtorLink)
	struct FString                                     LastUpdateTime;                                           // 0x00D0(0x000C) (Const, NeedCtorLink)
	float                                              AntiAddictionModifierNumber;                              // 0x00DC(0x0004) (Const)
	class UOnlineGameItemInstanceCollection*           ItemInstanceCollection;                                   // 0x00E0(0x0004) (Const)
	class UOnlineUnlockedAchievementCollection*        UnlockedAchievementCollection;                            // 0x00E4(0x0004) (Const)
	class UOnlinePlayerStats*                          Stats;                                                    // 0x00E8(0x0004) (Const)
	int                                                MeteorPoints;                                             // 0x00EC(0x0004) (Const)
	int                                                HawkenPoints;                                             // 0x00F0(0x0004) (Const)
	TArray<struct FString>                             ChatLog;                                                  // 0x00F4(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineAccountObject");
		return ptr;
	}


	void SetUniqueId(const struct FUniqueNetId& NewUniqueId);
	void MarkAchievementAsUnlocked(class UOnlineAchievementObject* AchievementObject);
	bool HasRole(const struct FString& Role);
	void ShutDown();
	void Init(class UOnlineAccountManager* Manager);
};


// Class OnlineSubsystemMeteor.OnlineAccountObjectDelegates
// 0x0000 (0x003C - 0x003C)
class UOnlineAccountObjectDelegates : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineAccountObjectDelegates");
		return ptr;
	}

};


// Class OnlineSubsystemMeteor.OnlineAchievementCollection
// 0x0041 (0x007D - 0x003C)
class UOnlineAchievementCollection : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x003C(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineAchievementCollection.AchievementsMap
	struct FPointer                                    AchievementIterator;                                      // 0x0078(0x0004) (Native, Transient)
	TEnumAsByte<EAchievementCollectionState>           CollectionState;                                          // 0x007C(0x0001) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineAchievementCollection");
		return ptr;
	}


	bool GetNextAchievement(class UOnlineAchievementObject** Achievement);
	void ResetAchievementIterator();
	void AddAchievements(class UOnlineAchievementCollection* Achievements);
	void SetAchievement(class UOnlineAchievementObject* Achievement, struct FUniqueNetId* AchievementId);
	class UOnlineAchievementObject* GetAchievement(struct FUniqueNetId* AchievementId);
	int NumAchievements();
};


// Class OnlineSubsystemMeteor.OnlineAchievementObject
// 0x00C0 (0x00FC - 0x003C)
class UOnlineAchievementObject : public UObject
{
public:
	struct FUniqueNetId                                AchievementGuid;                                          // 0x003C(0x0010) (Const)
	TEnumAsByte<EOnlineAchievementType>                AchievementType;                                          // 0x004C(0x0001) (Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
	unsigned long                                      bActive : 1;                                              // 0x0050(0x0004) (Const)
	unsigned long                                      bHideWhenLocked : 1;                                      // 0x0050(0x0004) (Const)
	unsigned long                                      bHackable : 1;                                            // 0x0050(0x0004) (Const)
	struct FString                                     Title;                                                    // 0x0054(0x000C) (Const, NeedCtorLink)
	struct FString                                     ImageId;                                                  // 0x0060(0x000C) (Const, NeedCtorLink)
	struct FString                                     LockedDescription;                                        // 0x006C(0x000C) (Const, NeedCtorLink)
	struct FString                                     UnlockedDescription;                                      // 0x0078(0x000C) (Const, NeedCtorLink)
	struct FString                                     DisplayUnits;                                             // 0x0084(0x000C) (Const, NeedCtorLink)
	float                                              DisplayUnitsDivider;                                      // 0x0090(0x0004) (Const)
	int                                                DiplaySortOrder;                                          // 0x0094(0x0004) (Const)
	struct FString                                     DisplayCategories;                                        // 0x0098(0x000C) (Const, NeedCtorLink)
	struct FString                                     ConditionStatThreshold;                                   // 0x00A4(0x000C) (Const, NeedCtorLink)
	int                                                ConditionStatThresholdValue;                              // 0x00B0(0x0004) (Const)
	TArray<struct FString>                             RewardOfferIds;                                           // 0x00B4(0x000C) (Const, NeedCtorLink)
	TArray<struct FAchievementStatReward>              RewardGameItemStats;                                      // 0x00C0(0x000C) (Const, NeedCtorLink)
	TArray<struct FAchievementStatReward>              RewardPlayerStats;                                        // 0x00CC(0x000C) (Const, NeedCtorLink)
	int                                                RewardHC;                                                 // 0x00D8(0x0004) (Const)
	int                                                RewardMC;                                                 // 0x00DC(0x0004) (Const)
	int                                                RewardAP;                                                 // 0x00E0(0x0004) (Const)
	struct FString                                     CountryCode;                                              // 0x00E4(0x000C) (Const, NeedCtorLink)
	TArray<struct FAchievementDeveloperData>           DeveloperData;                                            // 0x00F0(0x000C) (Const, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineAchievementObject");
		return ptr;
	}


	void CopyFrom(class UOnlineAchievementObject* AchievementObject);
};


// Class OnlineSubsystemMeteor.OnlineEventTracking
// 0x0000 (0x003C - 0x003C)
class UOnlineEventTracking : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineEventTracking");
		return ptr;
	}


	void STATIC_SendEvent_PlayerExitClient();
	void STATIC_SendEvent_PlayerLoggedIn(class AController* Player, const struct FString& GameVersion, const struct FString& CommandLine);
	void STATIC_SendEvent_WriteGameItemStats(const struct FString& InstanceID, TEnumAsByte<ENetworkErrorCode> ErrorCode, int TryCount, struct FUniqueNetId* PlayerID);
	void STATIC_SendEvent_WriteUserStats(TEnumAsByte<ENetworkErrorCode> ErrorCode, int TryCount, struct FUniqueNetId* PlayerID);
	void STATIC_SendEvent_UpdatedMatchMakingRating(class APlayerReplicationInfo* PRI, const struct FString& RatingKey, float RatingValue, const struct FString& DeviationKey, float DeviationValue);
	void STATIC_SendEvent_PeriodicServerPerformance(const struct FString& ServerName, int avgTickMs, int maxTickMS, int avgDeltaMS, int maxDeltaMS);
	void STATIC_SendEvent_ServerStarted(const struct FString& ServerName, const struct FString& Region, const struct FString& CommandLine);
	struct FString STATIC_ConvertProgressMessageSubTypeToString(TEnumAsByte<EProgressMessageSubType> MessageSubType);
	struct FString STATIC_ConvertConnectionStatusToString(TEnumAsByte<EOnlineServerConnectionStatus> ConnectionStatus);
	struct FString STATIC_ConvertOfferCurrencyToString(TEnumAsByte<EOfferCurrency> Currency);
	struct FString STATIC_ConvertNetworkErrorCodeToString(TEnumAsByte<ENetworkErrorCode> ErrorCode);
	bool STATIC_IsLoggedIn();
	class UStormEventObject* STATIC_CreateEventObject();
	void STATIC_DebugPrintEventObject(class UStormEventObject* eventObject);
	void STATIC_SendEventObject(class UStormEventObject* eventObject, bool bNoDebugTrace);
	struct FString STATIC_CreateGuidString();
	struct FString STATIC_GetLoggedInStormUserId();
	struct FString STATIC_GetUnrealEngineVersion();
	struct FString STATIC_GetBuiltFromChangelist();
	struct FString STATIC_GetUniqueBuildId();
	struct FString STATIC_GetServerListingGuid();
	struct FString STATIC_GetCurrentMatchID();
};


// Class OnlineSubsystemMeteor.OnlineFriendCollection
// 0x0040 (0x007C - 0x003C)
class UOnlineFriendCollection : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x003C(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineFriendCollection.FriendsMap
	struct FPointer                                    FriendIterator;                                           // 0x0078(0x0004) (Native, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineFriendCollection");
		return ptr;
	}


	void SetFriend(struct FOnlineFriend* Friend);
	bool FindFriendByName(const struct FString& FriendName, struct FOnlineFriend* Friend);
	bool GetNextFriend(struct FOnlineFriend* Friend);
	void ResetFriendIterator();
	bool GetFriend(struct FUniqueNetId* PlayerID, struct FOnlineFriend* Friend);
	int NumFriends();
};


// Class OnlineSubsystemMeteor.OnlineFriendObject
// 0x003C (0x0078 - 0x003C)
class UOnlineFriendObject : public UObject
{
public:
	struct FUniqueNetId                                PlayerID;                                                 // 0x003C(0x0010) (Const)
	TEnumAsByte<ESubscriptionStatus>                   SubscriptionStatus;                                       // 0x004C(0x0001) (Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
	struct FString                                     ServerListingGuid;                                        // 0x0050(0x000C) (Const, NeedCtorLink)
	TArray<struct FString>                             ChatMessages;                                             // 0x005C(0x000C) (Const, NeedCtorLink)
	struct FString                                     NickName;                                                 // 0x0068(0x000C) (Const, NeedCtorLink)
	unsigned long                                      bIsOnline : 1;                                            // 0x0074(0x0004) (Const)
	unsigned long                                      bIsPlaying : 1;                                           // 0x0074(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineFriendObject");
		return ptr;
	}


	bool HaveInvited();
	bool HasInvitedYou();
	bool ShouldBeDisplayed();
};


// Class OnlineSubsystemMeteor.OnlineGameBundle
// 0x0048 (0x0084 - 0x003C)
class UOnlineGameBundle : public UObject
{
public:
	struct FString                                     BundleId;                                                 // 0x003C(0x000C) (NeedCtorLink)
	struct FString                                     BundleDescription;                                        // 0x0048(0x000C) (NeedCtorLink)
	struct FString                                     BundleType;                                               // 0x0054(0x000C) (NeedCtorLink)
	struct FString                                     ExpiryDate;                                               // 0x0060(0x000C) (NeedCtorLink)
	unsigned long                                      VisibleToClient : 1;                                      // 0x006C(0x0004)
	unsigned long                                      MultiRedeemable : 1;                                      // 0x006C(0x0004)
	TArray<struct FString>                             GameOffers;                                               // 0x0070(0x000C) (NeedCtorLink)
	int                                                BundlePriceHawkenPoints;                                  // 0x007C(0x0004)
	int                                                BundlePriceMeteorPoints;                                  // 0x0080(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameBundle");
		return ptr;
	}


	bool IsExpired();
	bool IsVisibleToClient();
	bool IsMultiRedeemable();
	bool GetExpiryDate(struct FString* Date);
	bool GetHasExpiryDate();
};


// Class OnlineSubsystemMeteor.OnlineGameBundleCollection
// 0x0040 (0x007C - 0x003C)
class UOnlineGameBundleCollection : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x003C(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineGameBundleCollection.BundlesMap
	struct FPointer                                    BundleIterator;                                           // 0x0078(0x0004) (Native, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameBundleCollection");
		return ptr;
	}


	bool GetNextBundle(class UOnlineGameBundle** Bundle);
	void ResetBundleIterator();
	void SetBundle(const struct FString& Key, class UOnlineGameBundle* Bundle);
	class UOnlineGameBundle* GetBundle(const struct FString& Key);
	int NumBundles();
};


// Class OnlineSubsystemMeteor.OnlineGameInterfaceMeteor
// 0x00AC (0x0260 - 0x01B4)
class UOnlineGameInterfaceMeteor : public UOnlineGameInterfaceImpl
{
public:
	class UOnlineSubsystemMeteor*                      MeteorSubsystem;                                          // 0x01B4(0x0004)
	struct FPointer                                    ActiveGameServerListing;                                  // 0x01B8(0x0004) (Const, Native, Transient)
	struct FString                                     ActiveVoiceChannelListingGuid;                            // 0x01BC(0x000C) (Transient, NeedCtorLink)
	unsigned char                                      UnknownData00[0x3C];                                      // 0x01C8(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineGameInterfaceMeteor.CachedUserInfoMap
	struct FString                                     AllTalkChannelUri;                                        // 0x0204(0x000C) (Transient, NeedCtorLink)
	struct FString                                     ProskChannelUri;                                          // 0x0210(0x000C) (Transient, NeedCtorLink)
	struct FString                                     SentiumChannelUri;                                        // 0x021C(0x000C) (Transient, NeedCtorLink)
	struct FString                                     SpectatorChannelUri;                                      // 0x0228(0x000C) (Transient, NeedCtorLink)
	struct FString                                     VoiceTestChannelUri;                                      // 0x0234(0x000C) (Transient, NeedCtorLink)
	struct FString                                     CurrentMatchID;                                           // 0x0240(0x000C) (NeedCtorLink)
	float                                              NextServerListingUpdateTime;                              // 0x024C(0x0004)
	float                                              ServerListingUpdateRate;                                  // 0x0250(0x0004)
	float                                              NextPlayersPresenceUpdateTime;                            // 0x0254(0x0004)
	float                                              PlayersPresenceUpdateRate;                                // 0x0258(0x0004)
	float                                              AntiAddictionModifierOverride;                            // 0x025C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameInterfaceMeteor");
		return ptr;
	}


	bool CheckServerPassword(const struct FString& ServerPassword, const struct FString& ToCheck);
	void SetAntiAddictionModifierOverride(float Modifier);
	float GetPlayerAntiAddictionModifier(struct FUniqueNetId* PlayerID);
	void GenerateCurrentMatchID();
	void TickInternetTasks(float DeltaTime);
	bool UpdateOnlineGame(const struct FName& SessionName, class UOnlineGameSettings* UpdatedGameSettings, bool bShouldRefreshOnlineData);
	bool CreateOnlineGame(unsigned char HostingPlayerNum, const struct FName& SessionName, class UOnlineGameSettings* NewGameSettings);
	bool UnregisterPlayer(const struct FName& SessionName, const struct FUniqueNetId& PlayerID);
	bool RegisterPlayer(const struct FName& SessionName, const struct FUniqueNetId& PlayerID, bool bWasInvited);
	struct FString GetServerRegion();
};


// Class OnlineSubsystemMeteor.OnlineGameItem
// 0x0060 (0x009C - 0x003C)
class UOnlineGameItem : public UObject
{
public:
	struct FString                                     TypeId;                                                   // 0x003C(0x000C) (Const, NeedCtorLink)
	struct FString                                     Version;                                                  // 0x0048(0x000C) (Const, NeedCtorLink)
	struct FString                                     ItemName;                                                 // 0x0054(0x000C) (Const, NeedCtorLink)
	unsigned char                                      UnknownData00[0x3C];                                      // 0x0060(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineGameItem.AttributesMap

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameItem");
		return ptr;
	}


	void SetAttributeString(const struct FString& Key, const struct FString& Value);
	struct FString GetAttributeValue(const struct FString& Key, const struct FString& Default);
	struct FOnlineGameItemAttribute GetAttribute(int Index);
	int NumAttributes();
};


// Class OnlineSubsystemMeteor.OnlineGameItemInstance
// 0x0060 (0x00FC - 0x009C)
class UOnlineGameItemInstance : public UOnlineGameItem
{
public:
	struct FString                                     InstanceID;                                               // 0x009C(0x000C) (Const, NeedCtorLink)
	struct FString                                     Parent;                                                   // 0x00A8(0x000C) (Const, NeedCtorLink)
	TArray<struct FString>                             ChildrenList;                                             // 0x00B4(0x000C) (Const, NeedCtorLink)
	unsigned char                                      UnknownData00[0x3C];                                      // 0x00C0(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineGameItemInstance.StatsMap

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameItemInstance");
		return ptr;
	}


	void DebugTestFunctions();
	bool STATIC_DoesTimeIndicateRental(const struct FString& ExpiryDate);
	bool STATIC_IsTimeDefaultData(const struct FString& ExpiryDate);
	bool STATIC_HasUTCTimePassed(const struct FString& UTCTime);
	struct FString STATIC_GetCurrentUTCTimeStringMeteorFormat();
	bool STATIC_ConvertMinutesToTime(int totalSeconds, int* Day, int* Hour, int* Min);
	bool STATIC_ConvertSecondsToTime(int totalSeconds, int* Day, int* Hour, int* Min, int* Sec);
	bool STATIC_ParseMeteorTimeStringIntoInt(const struct FString& meteorTime, bool bRemoveDefaultData, int* Year, int* Month, int* Day, int* Hour, int* Min, int* Sec);
	bool STATIC_ParseMeteorTimeStringIntoString(const struct FString& meteorTime, struct FString* sYear, struct FString* sMonth, struct FString* sDay, struct FString* sHour, struct FString* sMin, struct FString* sSec);
	void STATIC_GetTimeMeteorFormat(int Year, int Month, int Day, int Hour, int Min, int Sec, struct FString* formattedTime);
	void SetExpirationDateToDefault();
	bool DecrementLimitedUses();
	bool IsExpired();
	bool GetRemainingRentalTime(int* daysOut, int* hoursOut, int* minutesOut, int* secondsOut);
	bool GetRemainingRentalTimeAsString(struct FString* RemainingTime);
	bool IsUseLimitedWithGet(int* TotalUses, int* usesLeft);
	bool IsUseLimited();
	bool IsTimedRentalWithGet(struct FString* ExpiryDate);
	bool IsTimedRental();
};


// Class OnlineSubsystemMeteor.OnlineGameItemType
// 0x000C (0x00A8 - 0x009C)
class UOnlineGameItemType : public UOnlineGameItem
{
public:
	TArray<struct FString>                             StoreOfferIds;                                            // 0x009C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameItemType");
		return ptr;
	}

};


// Class OnlineSubsystemMeteor.OnlineGameItemInstanceCollection
// 0x0042 (0x007E - 0x003C)
class UOnlineGameItemInstanceCollection : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x003C(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineGameItemInstanceCollection.ItemsMap
	struct FPointer                                    ItemIterator;                                             // 0x0078(0x0004) (Native, Transient)
	TEnumAsByte<EInstanceCollectionState>              ItemsLoadingState;                                        // 0x007C(0x0001) (Const)
	TEnumAsByte<EInstanceCollectionState>              StatsLoadingState;                                        // 0x007D(0x0001) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameItemInstanceCollection");
		return ptr;
	}


	bool GetNextItem(class UOnlineGameItemInstance** Item);
	void ResetItemIterator();
	void AddItems(class UOnlineGameItemInstanceCollection* Items);
	void SetItem(const struct FString& Key, class UOnlineGameItemInstance* Item);
	TArray<class UOnlineGameItemInstance*> GetItemsByTypeId(const struct FString& TypeId);
	class UOnlineGameItemInstance* GetItem(const struct FString& Key);
	int NumItems();
};


// Class OnlineSubsystemMeteor.OnlineGameItemTypeCollection
// 0x0040 (0x007C - 0x003C)
class UOnlineGameItemTypeCollection : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x003C(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineGameItemTypeCollection.ItemsMap
	struct FPointer                                    ItemIterator;                                             // 0x0078(0x0004) (Native, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameItemTypeCollection");
		return ptr;
	}


	bool GetNextItem(class UOnlineGameItemType** Item);
	void ResetItemIterator();
	void SetItem(const struct FString& Key, class UOnlineGameItemType* Item);
	class UOnlineGameItemType* GetItem(const struct FString& Key);
	int NumItems();
};


// Class OnlineSubsystemMeteor.OnlineGameOffer
// 0x006C (0x00A8 - 0x003C)
class UOnlineGameOffer : public UObject
{
public:
	struct FString                                     OfferId;                                                  // 0x003C(0x000C) (NeedCtorLink)
	struct FString                                     OfferDescription;                                         // 0x0048(0x000C) (NeedCtorLink)
	TArray<struct FString>                             GameItems;                                                // 0x0054(0x000C) (NeedCtorLink)
	int                                                OfferPriceHawkenPoints;                                   // 0x0060(0x0004)
	int                                                OfferPriceMeteorPoints;                                   // 0x0064(0x0004)
	unsigned char                                      UnknownData00[0x3C];                                      // 0x0068(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineGameOffer.AttributesMap
	struct FPointer                                    AttributeIterator;                                        // 0x00A4(0x0004) (Native, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameOffer");
		return ptr;
	}


	void DebugTestFunctions();
	bool STATIC_IsRentalPurchaseOfferDefault(const struct FString& RentalPurchaseOfferID);
	bool IsExpired();
	bool GetUseLimit(int* TotalUses);
	bool GetHasUseLimit();
	bool GetRelativeExpiry(int* RelativeExpiryMinutes);
	bool GetHasRelativeExpiry();
	bool GetExpiryDate(struct FString* ExpiryDate);
	bool GetHasExpiryDate();
	bool GetNextAttribute(struct FOnlineGameOfferAttribute* Attribute);
	void ResetAttributeIterator();
	void SetAttributeString(const struct FString& Key, const struct FString& Value);
	struct FString GetAttributeValue(const struct FString& Key, const struct FString& Default);
	int NumAttributes();
};


// Class OnlineSubsystemMeteor.OnlineGameOfferCollection
// 0x0040 (0x007C - 0x003C)
class UOnlineGameOfferCollection : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x003C(0x003C) UNKNOWN PROPERTY: MapProperty OnlineSubsystemMeteor.OnlineGameOfferCollection.OffersMap
	struct FPointer                                    OfferIterator;                                            // 0x0078(0x0004) (Native, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineGameOfferCollection");
		return ptr;
	}


	bool GetNextOffer(class UOnlineGameOffer** Offer);
	void ResetOfferIterator();
	void SetOffer(const struct FString& Key, class UOnlineGameOffer* Offer);
	class UOnlineGameOffer* GetOffer(const struct FString& Key);
	int NumOffers();
};


// Class OnlineSubsystemMeteor.OnlineInventoryManager
// 0x0018 (0x0054 - 0x003C)
class UOnlineInventoryManager : public UObject
{
public:
	class UOnlineSubsystemMeteor*                      MeteorOSS;                                                // 0x003C(0x0004) (Transient)
	class UOnlineGameOfferCollection*                  GameOfferCollection;                                      // 0x0040(0x0004)
	class UOnlineGameBundleCollection*                 GameBundleCollection;                                     // 0x0044(0x0004)
	class UOnlineGameItemTypeCollection*               GameItemTypeCollection;                                   // 0x0048(0x0004)
	class UOnlineAchievementCollection*                AchievementCollection;                                    // 0x004C(0x0004)
	class UOnlineInventoryManagerDelegates*            Delegates;                                                // 0x0050(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineInventoryManager");
		return ptr;
	}


	void ShutDown();
	void Init(class UOnlineSubsystem* OnlineSub);
};


// Class OnlineSubsystemMeteor.OnlineInventoryManagerDelegates
// 0x0000 (0x003C - 0x003C)
class UOnlineInventoryManagerDelegates : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineInventoryManagerDelegates");
		return ptr;
	}

};


// Class OnlineSubsystemMeteor.OnlineMailMessage
// 0x002C (0x0068 - 0x003C)
class UOnlineMailMessage : public UObject
{
public:
	struct FString                                     MessageId;                                                // 0x003C(0x000C) (Const, NeedCtorLink)
	struct FUniqueNetId                                PlayerID;                                                 // 0x0048(0x0010) (Const)
	struct FString                                     TimeStamp;                                                // 0x0058(0x000C) (Const, NeedCtorLink)
	unsigned long                                      bRead : 1;                                                // 0x0064(0x0004) (Const)
	unsigned long                                      bDownloaded : 1;                                          // 0x0064(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineMailMessage");
		return ptr;
	}

};


// Class OnlineSubsystemMeteor.OnlineMailMessage_Emergency
// 0x0018 (0x0080 - 0x0068)
class UOnlineMailMessage_Emergency : public UOnlineMailMessage
{
public:
	struct FString                                     MessageTitle;                                             // 0x0068(0x000C) (Const, NeedCtorLink)
	struct FString                                     MessageBody;                                              // 0x0074(0x000C) (Const, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineMailMessage_Emergency");
		return ptr;
	}

};


// Class OnlineSubsystemMeteor.OnlineMailMessage_FriendRequest
// 0x0018 (0x0080 - 0x0068)
class UOnlineMailMessage_FriendRequest : public UOnlineMailMessage
{
public:
	struct FString                                     FromUserName;                                             // 0x0068(0x000C) (Const, NeedCtorLink)
	struct FString                                     MessageText;                                              // 0x0074(0x000C) (Const, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineMailMessage_FriendRequest");
		return ptr;
	}

};


// Class OnlineSubsystemMeteor.OnlineSubsystemMeteor
// 0x06FC (0x081C - 0x0120)
class UOnlineSubsystemMeteor : public UOnlineSubsystemCommonImpl
{
public:
	struct FPointer                                    LeMeteorCore;                                             // 0x0120(0x0004) (Const, Native, Transient)
	struct FPointer                                    AuthenticationConsumer;                                   // 0x0124(0x0004) (Const, Native, Transient)
	struct FPointer                                    EventConsumer;                                            // 0x0128(0x0004) (Const, Native, Transient)
	struct FPointer                                    GameItemConsumer;                                         // 0x012C(0x0004) (Const, Native, Transient)
	struct FPointer                                    GameManagerConsumer;                                      // 0x0130(0x0004) (Const, Native, Transient)
	struct FPointer                                    GameOfferConsumer;                                        // 0x0134(0x0004) (Const, Native, Transient)
	struct FPointer                                    GameBundleConsumer;                                       // 0x0138(0x0004) (Const, Native, Transient)
	struct FPointer                                    SettingsConsumer;                                         // 0x013C(0x0004) (Const, Native, Transient)
	struct FPointer                                    ShopConsumer;                                             // 0x0140(0x0004) (Const, Native, Transient)
	struct FPointer                                    VoiceConsumer;                                            // 0x0144(0x0004) (Const, Native, Transient)
	struct FPointer                                    XMPPConsumer;                                             // 0x0148(0x0004) (Const, Native, Transient)
	struct FPointer                                    AchievementsConsumer;                                     // 0x014C(0x0004) (Const, Native, Transient)
	struct FPointer                                    UserStatsConsumer;                                        // 0x0150(0x0004) (Const, Native, Transient)
	struct FPointer                                    PartyConsumer;                                            // 0x0154(0x0004) (Const, Native, Transient)
	struct FPointer                                    VersionConsumer;                                          // 0x0158(0x0004) (Const, Native, Transient)
	struct FPointer                                    StatOverflowConsumer;                                     // 0x015C(0x0004) (Const, Native, Transient)
	class UOnlineGameInterfaceMeteor*                  MeteorGameInterface;                                      // 0x0160(0x0004)
	class UOnlineMatchmakingManager*                   MatchmakingManager;                                       // 0x0164(0x0004)
	class UOnlineXMPPInterfaceMeteor*                  XMPPInterface;                                            // 0x0168(0x0004)
	struct FString                                     OnlinePartyManagerClassName;                              // 0x016C(0x000C) (Config, NeedCtorLink)
	class UOnlinePartyManager*                         PartyManager;                                             // 0x0178(0x0004) (Transient)
	struct FString                                     OnlineAccountManagerClassName;                            // 0x017C(0x000C) (Config, NeedCtorLink)
	class UOnlineAccountManager*                       AccountManager;                                           // 0x0188(0x0004) (Transient)
	struct FString                                     OnlineInventoryManagerClassName;                          // 0x018C(0x000C) (Config, NeedCtorLink)
	class UOnlineInventoryManager*                     InventoryManager;                                         // 0x0198(0x0004) (Transient)
	struct FString                                     CurrentVoiceChannelUri;                                   // 0x019C(0x000C) (NeedCtorLink)
	TArray<struct FPointer>                            AsyncTasks;                                               // 0x01A8(0x000C) (Const, Native)
	struct FString                                     ProfileDataDirectory;                                     // 0x01B4(0x000C) (Config, NeedCtorLink)
	struct FString                                     ProfileDataExtension;                                     // 0x01C0(0x000C) (Config, NeedCtorLink)
	unsigned long                                      bIsLoggedIn : 1;                                          // 0x01CC(0x0004)
	unsigned long                                      bLastHasLink : 1;                                         // 0x01CC(0x0004)
	unsigned long                                      bDisableCheckClientVersion : 1;                           // 0x01CC(0x0004) (Config)
	unsigned long                                      bIsExternalUIOpen : 1;                                    // 0x01CC(0x0004) (Const)
	float                                              CheckLinkTimeInterval;                                    // 0x01D0(0x0004)
	float                                              CheckLinkElapsedTime;                                     // 0x01D4(0x0004)
	TEnumAsByte<EOnlineServerConnectionStatus>         LastConnectionStatus;                                     // 0x01D8(0x0001)
	TEnumAsByte<EOnlineServerConnectionStatus>         LastServerStatus;                                         // 0x01D9(0x0001)
	TEnumAsByte<EJoinServerFrom>                       ConnectionRequestFrom;                                    // 0x01DA(0x0001)
	unsigned char                                      UnknownData00[0x1];                                       // 0x01DB(0x0001) MISSED OFFSET
	int                                                MaxCheckConnectionRetries;                                // 0x01DC(0x0004)
	int                                                NumCheckConnectionRetries;                                // 0x01E0(0x0004)
	int                                                NumCheckServerRetries;                                    // 0x01E4(0x0004)
	float                                              CheckConnectionTimeInterval;                              // 0x01E8(0x0004)
	float                                              CheckConnectionElapsedTime;                               // 0x01EC(0x0004)
	struct FString                                     ConnectionStatusMessage;                                  // 0x01F0(0x000C) (Const, NeedCtorLink)
	struct FString                                     ServerStatusMessage;                                      // 0x01FC(0x000C) (Const, NeedCtorLink)
	struct FString                                     ConnectionRequestId;                                      // 0x0208(0x000C) (NeedCtorLink)
	struct FString                                     SupportedClientVersions;                                  // 0x0214(0x000C) (Const, NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadProfileSettingsDelegates;                             // 0x0220(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     WriteProfileSettingsDelegates;                            // 0x022C(0x000C) (NeedCtorLink)
	class UOnlineProfileSettings*                      CachedProfile;                                            // 0x0238(0x0004)
	class UOnlineGameItemType*                         Globals;                                                  // 0x023C(0x0004)
	TArray<struct FUniqueNetId>                        SpeakingUserIds;                                          // 0x0240(0x000C) (Const, NeedCtorLink)
	float                                              ServerPilotLevel;                                         // 0x024C(0x0004)
	int                                                ServerPlayerCount;                                        // 0x0250(0x0004)
	int                                                ServerProgressionScore;                                   // 0x0254(0x0004)
	int                                                ServerRankingScore;                                       // 0x0258(0x0004)
	float                                              ClientRequestTimeout;                                     // 0x025C(0x0004) (Config)
	TArray<struct FScriptDelegate>                     LoginChangeDelegates;                                     // 0x0260(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     LoginFailedDelegates;                                     // 0x026C(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     LogoutCompletedDelegates;                                 // 0x0278(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     CreateOnlineAccountCompletedDelegates;                    // 0x0284(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     SpeechRecognitionCompleteDelegates;                       // 0x0290(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadFriendsDelegates;                                     // 0x029C(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     FriendsChangeDelegates;                                   // 0x02A8(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     MutingChangeDelegates;                                    // 0x02B4(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     FindOnlineGameServersCompletedDelegates;                  // 0x02C0(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     FindUnrankedMatchCompletedDelegates;                      // 0x02CC(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadUserStatsCompleteDelegates;                           // 0x02D8(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     WriteUserStatsCompleteDelegates;                          // 0x02E4(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadUserSettingsCompleteDelegates;                        // 0x02F0(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     WriteUserSettingsCompleteDelegates;                       // 0x02FC(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     LinkStatusDelegates;                                      // 0x0308(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ConnectionStatusChangeDelegates;                          // 0x0314(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ServersStatusChangedDelegates;                            // 0x0320(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     CreateVoiceChannelsCompleteDelegates;                     // 0x032C(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     JoinVoiceChannelCompleteDelegates;                        // 0x0338(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     LeaveVoiceChannelCompleteDelegates;                       // 0x0344(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadGameItemInstanceCollectionCompleteDelegates;          // 0x0350(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadGameItemInstancesCompleteDelegates;                   // 0x035C(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     UpdateGameItemInstanceCompleteDelegates;                  // 0x0368(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     IncrementUserGameItemStatsCompleteDelegates;              // 0x0374(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     BatchIncrementUserGameItemStatsCompleteDelegates;         // 0x0380(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadUserGameItemStatsCompletedDelegates;                  // 0x038C(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadAllUserGameItemStatsCompletedDelegates;               // 0x0398(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     DeleteGameItemInstanceCompleteDelegates;                  // 0x03A4(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadGameItemTypeCollectionCompleteDelegates;              // 0x03B0(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ValidateClientConnectionCompleteDelegates;                // 0x03BC(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadGameOfferCollectionCompleteDelegates;                 // 0x03C8(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadGameBundleCollectionCompleteDelegates;                // 0x03D4(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     PurchaseGameOfferCompleteDelegates;                       // 0x03E0(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ServerPurchaseGameOfferCompleteDelegates;                 // 0x03EC(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     PurchaseGameBundleCompleteDelegates;                      // 0x03F8(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     RentGameOfferCompleteDelegates;                           // 0x0404(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     RequestReservationCompleteDelegates;                      // 0x0410(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     RefreshWalletCompleteDelegates;                           // 0x041C(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     GetOverflowCompleteDelegates;                             // 0x0428(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     SendToXPOverflowCompleteDelegates;                        // 0x0434(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     GetFromXPOverflowCompleteDelegates;                       // 0x0440(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     GiveWalletCurrencyCompleteDelegates;                      // 0x044C(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadAchievementCollectionCompletedDelegates;              // 0x0458(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ReadUnlockedAchievementCollectionCompletedDelegates;      // 0x0464(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     UnlockAchievementObjectCompletedDelegates;                // 0x0470(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     RefreshUserInfoCompletedDelegates;                        // 0x047C(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     SetGameTypeCompletedDelegates;                            // 0x0488(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     LocalPlayerRoleAuthorizationDelegates;                    // 0x0494(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     ExternalUIChangeDelegates;                                // 0x04A0(0x000C) (NeedCtorLink)
	TArray<struct FString>                             NetworkErrorNames;                                        // 0x04AC(0x000C) (Const, Localized, NeedCtorLink)
	TArray<struct FStormGameServerListing>             OnlineGameServers;                                        // 0x04B8(0x000C) (NeedCtorLink)
	class UClass*                                      DefaultGameSearchClass;                                   // 0x04C4(0x0004)
	struct FScriptDelegate                             __OnCreateVoiceChannelsComplete__Delegate;                // 0x04C8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnJoinVoiceChannelComplete__Delegate;                   // 0x04D4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnLeaveVoiceChannelComplete__Delegate;                  // 0x04E0(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnValidateClientConnectionComplete__Delegate;           // 0x04EC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnLoginChange__Delegate;                                // 0x04F8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnLoginCancelled__Delegate;                             // 0x0504(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnMutingChange__Delegate;                               // 0x0510(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadTitleFileComplete__Delegate;                      // 0x051C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnPlayerTalkingStateChange__Delegate;                   // 0x0528(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnFriendsChange__Delegate;                              // 0x0534(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnLoginFailed__Delegate;                                // 0x0540(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnLogoutCompleted__Delegate;                            // 0x054C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadProfileSettingsComplete__Delegate;                // 0x0558(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnWriteProfileSettingsComplete__Delegate;               // 0x0564(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnLoginStatusChange__Delegate;                          // 0x0570(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadFriendsComplete__Delegate;                        // 0x057C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRecognitionComplete__Delegate;                        // 0x0588(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadOnlineStatsComplete__Delegate;                    // 0x0594(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnFlushOnlineStatsComplete__Delegate;                   // 0x05A0(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRegisterHostStatGuidComplete__Delegate;               // 0x05AC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnLinkStatusChange__Delegate;                           // 0x05B8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnExternalUIChange__Delegate;                           // 0x05C4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnControllerChange__Delegate;                           // 0x05D0(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnConnectionStatusChange__Delegate;                     // 0x05DC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnServerStatusChange__Delegate;                         // 0x05E8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnStorageDeviceChange__Delegate;                        // 0x05F4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnKeyboardInputComplete__Delegate;                      // 0x0600(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnWritePlayerStorageComplete__Delegate;                 // 0x060C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadPlayerStorageForNetIdComplete__Delegate;          // 0x0618(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadPlayerStorageComplete__Delegate;                  // 0x0624(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnAddFriendByNameComplete__Delegate;                    // 0x0630(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnFriendInviteReceived__Delegate;                       // 0x063C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReceivedGameInvite__Delegate;                         // 0x0648(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnJoinFriendGameComplete__Delegate;                     // 0x0654(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnFriendMessageReceived__Delegate;                      // 0x0660(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnUnlockAchievementComplete__Delegate;                  // 0x066C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadAchievementsComplete__Delegate;                   // 0x0678(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnCreateOnlineAccountCompleted__Delegate;               // 0x0684(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnFindOnlineGameServersCompleted__Delegate;             // 0x0690(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadUserStatsComplete__Delegate;                      // 0x069C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnWriteUserStatsComplete__Delegate;                     // 0x06A8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadUserSettingsComplete__Delegate;                   // 0x06B4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnWriteUserSettingsComplete__Delegate;                  // 0x06C0(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadGameItemInstanceCollectionComplete__Delegate;     // 0x06CC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadGameItemInstancesComplete__Delegate;              // 0x06D8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnUpdateGameItemInstanceComplete__Delegate;             // 0x06E4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnIncrementUserGameItemStatsComplete__Delegate;         // 0x06F0(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnBatchIncrementUserGameItemStatsComplete__Delegate;    // 0x06FC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadUserGameItemStatsCompleted__Delegate;             // 0x0708(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadAllUserGameItemStatsCompleted__Delegate;          // 0x0714(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDeleteGameItemInstanceComplete__Delegate;             // 0x0720(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadGameItemTypeCollectionComplete__Delegate;         // 0x072C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadGameOfferCollectionComplete__Delegate;            // 0x0738(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadGameBundleCollectionComplete__Delegate;           // 0x0744(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnPurchaseGameBundleComplete__Delegate;                 // 0x0750(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnPurchaseGameOfferComplete__Delegate;                  // 0x075C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnServerPurchaseGameOfferComplete__Delegate;            // 0x0768(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRentGameOfferComplete__Delegate;                      // 0x0774(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRefreshWalletComplete__Delegate;                      // 0x0780(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnGetOverflowComplete__Delegate;                        // 0x078C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnSendToXPOverflowComplete__Delegate;                   // 0x0798(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnGetFromXPOverflowComplete__Delegate;                  // 0x07A4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnGiveWalletCurrencyComplete__Delegate;                 // 0x07B0(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRequestReservationComplete__Delegate;                 // 0x07BC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnFindUnrankedMatchCompleted__Delegate;                 // 0x07C8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRoleAuthorizeComplete__Delegate;                      // 0x07D4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadAchievementCollectionCompleted__Delegate;         // 0x07E0(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnReadUnlockedAchievementCollectionCompleted__Delegate; // 0x07EC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnUnlockAchievementObjectCompleted__Delegate;           // 0x07F8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRefreshUserInfoCompleted__Delegate;                   // 0x0804(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnSetGameTypeCompleted__Delegate;                       // 0x0810(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OnlineSubsystemMeteor.OnlineSubsystemMeteor");
		return ptr;
	}


	bool STATIC_UuidStringToUniqueNetId(const struct FString& UniqueNetIdString, struct FUniqueNetId* out_UniqueId);
	struct FString STATIC_UniqueNetIdToUuidString(struct FUniqueNetId* IdToConvert);
