#pragma once

// Hawken (1.5.3.142579) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class UDKBase.ParticleModuleTypeDataSnow
// 0x00B4 (0x00FC - 0x0048)
class UParticleModuleTypeDataSnow : public UParticleModuleTypeDataBase
{
public:
	struct FRawDistributionVector                      StartSize;                                                // 0x0048(0x001C) (Edit, Component, NeedCtorLink)
	struct FRawDistributionVector                      StartVelocity;                                            // 0x0064(0x001C) (Edit, Component, NeedCtorLink)
	struct FRawDistributionVector                      StartLocation;                                            // 0x0080(0x001C) (Edit, Component, NeedCtorLink)
	struct FRawDistributionVector                      ColorOverLife;                                            // 0x009C(0x001C) (Edit, Component, NeedCtorLink)
	struct FRawDistributionFloat                       AlphaOverLife;                                            // 0x00B8(0x001C) (Edit, Component, NeedCtorLink)
	struct FRawDistributionFloat                       Lifetime;                                                 // 0x00D4(0x001C) (Edit, Component, NeedCtorLink)
	float                                              KillHeight;                                               // 0x00F0(0x0004) (Edit)
	float                                              FadeStart;                                                // 0x00F4(0x0004) (Edit)
	float                                              FadeStop;                                                 // 0x00F8(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.ParticleModuleTypeDataSnow");
		return ptr;
	}

};


// Class UDKBase.SimpleGame
// 0x0000 (0x03A8 - 0x03A8)
class ASimpleGame : public AFrameworkGame
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.SimpleGame");
		return ptr;
	}


	class UClass* STATIC_SetGameType(const struct FString& MapName, const struct FString& Options, const struct FString& Portal);
	struct FString STATIC_StripPlayOnPrefix(const struct FString& MapName);
	bool STATIC_HasPlayOnPrefix(const struct FString& MapName, int* PrefixLength);
};


// Class UDKBase.UDKGame
// 0x0000 (0x03A8 - 0x03A8)
class AUDKGame : public ASimpleGame
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKGame");
		return ptr;
	}

};


// Class UDKBase.UDKAIDecisionComponent
// 0x0007 (0x005C - 0x0055)
class UUDKAIDecisionComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	unsigned long                                      bTriggered : 1;                                           // 0x0058(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKAIDecisionComponent");
		return ptr;
	}

};


// Class UDKBase.UDKBot
// 0x00C8 (0x0438 - 0x0370)
class AUDKBot : public AAIController
{
public:
	class AUDKSquadAI*                                 Squad;                                                    // 0x0370(0x0004)
	class UUDKAIDecisionComponent*                     DecisionComponent;                                        // 0x0374(0x0004) (ExportObject, Component, EditInline)
	class AActor*                                      TemporaryFocus;                                           // 0x0378(0x0004)
	unsigned long                                      bExecutingWhatToDoNext : 1;                               // 0x037C(0x0004)
	unsigned long                                      bScriptSpecialJumpCost : 1;                               // 0x037C(0x0004)
	unsigned long                                      bForceRefreshRoute : 1;                                   // 0x037C(0x0004)
	unsigned long                                      bTargetAlternateLoc : 1;                                  // 0x037C(0x0004)
	unsigned long                                      bEnemyInfoValid : 1;                                      // 0x037C(0x0004)
	unsigned long                                      bEnemyIsVisible : 1;                                      // 0x037C(0x0004)
	unsigned long                                      bLeadTarget : 1;                                          // 0x037C(0x0004)
	unsigned long                                      bJumpOverWall : 1;                                        // 0x037C(0x0004)
	unsigned long                                      bPlannedJump : 1;                                         // 0x037C(0x0004)
	unsigned long                                      bInDodgeMove : 1;                                         // 0x037C(0x0004)
	unsigned long                                      bEnemyAcquired : 1;                                       // 0x037C(0x0004)
	unsigned long                                      bNeedDelayedLeaveVehicle : 1;                             // 0x037C(0x0004)
	unsigned long                                      bAllowRouteReuse : 1;                                     // 0x037C(0x0004)
	unsigned long                                      bUsingSquadRoute : 1;                                     // 0x037C(0x0004)
	unsigned long                                      bUsePreviousSquadRoute : 1;                               // 0x037C(0x0004)
	unsigned char                                      ScriptedFireMode;                                         // 0x0380(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0381(0x0003) MISSED OFFSET
	float                                              EnemyVisibilityTime;                                      // 0x0384(0x0004)
	class APawn*                                       VisibleEnemy;                                             // 0x0388(0x0004)
	class AVehicle*                                    LastBlockingVehicle;                                      // 0x038C(0x0004)
	class APawn*                                       CurrentlyTrackedEnemy;                                    // 0x0390(0x0004)
	TArray<struct FEnemyPosition>                      SavedPositions;                                           // 0x0394(0x000C) (NeedCtorLink)
	struct FVector                                     ImpactVelocity;                                           // 0x03A0(0x000C)
	int                                                AcquisitionYawRate;                                       // 0x03AC(0x0004)
	float                                              HearingThreshold;                                         // 0x03B0(0x0004)
	float                                              RespawnPredictionTime;                                    // 0x03B4(0x0004)
	float                                              WarningDelay;                                             // 0x03B8(0x0004)
	class AProjectile*                                 WarningProjectile;                                        // 0x03BC(0x0004)
	struct FVector                                     MonitorStartLoc;                                          // 0x03C0(0x000C)
	class APawn*                                       MonitoredPawn;                                            // 0x03CC(0x0004)
	float                                              MonitorMaxDistSq;                                         // 0x03D0(0x0004)
	struct FVector                                     LastSeenPos;                                              // 0x03D4(0x000C)
	struct FVector                                     LastSeeingPos;                                            // 0x03E0(0x000C)
	float                                              LastSeenTime;                                             // 0x03EC(0x0004)
	float                                              TrackingReactionTime;                                     // 0x03F0(0x0004)
	float                                              BaseTrackingReactionTime;                                 // 0x03F4(0x0004)
	struct FVector                                     TrackedVelocity;                                          // 0x03F8(0x000C)
	class ANavigationPoint*                            SquadRouteGoal;                                           // 0x0404(0x0004)
	class APawn*                                       BlockedAimTarget;                                         // 0x0408(0x0004)
	float                                              LastIterativeCheck;                                       // 0x040C(0x0004)
	float                                              AimUpdateFrequency;                                       // 0x0410(0x0004)
	float                                              LastAimUpdateTime;                                        // 0x0414(0x0004)
	float                                              ErrorUpdateFrequency;                                     // 0x0418(0x0004)
	float                                              LastErrorUpdateTime;                                      // 0x041C(0x0004)
	float                                              CurrentAimError;                                          // 0x0420(0x0004)
	float                                              DodgeLandZ;                                               // 0x0424(0x0004)
	class AActor*                                      FearSpots[0x2];                                           // 0x0428(0x0004)
	float                                              DodgeToGoalPct;                                           // 0x0430(0x0004)
	float                                              MultiJumpZ;                                               // 0x0434(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKBot");
		return ptr;
	}


	void DelayedLeaveVehicle();
	void DelayedWarning();
	void MissedDodge();
	float AdjustAimError(float TargetDist, bool bInstantProj);
	float SuperDesireability(class APickupFactory* P);
	bool SpecialJumpCost(float RequiredJumpZ, float* Cost);
	void MayDodgeToMoveTarget();
	void TimeDJReset();
	void MonitoredPawnAlert();
	void WhatToDoNext();
	class AActor* FindBestSuperPickup(float MaxDist);
	void BuildSquadRoute();
	class AActor* FindPathToSquadRoute(bool bWeightDetours);
	class AActor* FindBestInventoryPath(float* MinWeight);
	bool CanMakePathTo(class AActor* A);
	void LatentWhatToDoNext();
	void WaitToSeeEnemy();
	void ReceiveRunOverWarning(class AUDKVehicle* V, float projSpeed, const struct FVector& VehicleDir);
	void ExecuteWhatToDoNext();
	class AActor* FaceActor(float StrafingModifier);
};


// Class UDKBase.UDKCarriedObject
// 0x0038 (0x020C - 0x01D4)
class AUDKCarriedObject : public AActor
{
public:
	class ATeamInfo*                                   Team;                                                     // 0x01D4(0x0004) (Net)
	class ANavigationPoint*                            LastAnchor;                                               // 0x01D8(0x0004) (Const)
	float                                              LastValidAnchorTime;                                      // 0x01DC(0x0004)
	class USkeletalMeshComponent*                      SkelMesh;                                                 // 0x01E0(0x0004) (ExportObject, Component, EditInline)
	unsigned long                                      bHome : 1;                                                // 0x01E4(0x0004) (Net)
	class AUDKGameObjective*                           HomeBase;                                                 // 0x01E8(0x0004) (Net)
	struct FVector                                     HomeBaseOffset;                                           // 0x01EC(0x000C)
	class AActor*                                      OldBase;                                                  // 0x01F8(0x0004)
	class AActor*                                      OldBaseBase;                                              // 0x01FC(0x0004)
	struct FVector                                     HUDLocation;                                              // 0x0200(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKCarriedObject");
		return ptr;
	}


	unsigned char GetTeamNum();
	void OnBaseChainChanged();
	void NotReachableBy(class APawn* P);
	void SetHUDLocation(const struct FVector& NewHUDLocation);
};


// Class UDKBase.UDKDataStore_GameSearchBase
// 0x0004 (0x0094 - 0x0090)
class UUDKDataStore_GameSearchBase : public UUIDataStore_OnlineGameSearch
{
public:
	class UUDKUIDataProvider_ServerDetails*            ServerDetailsProvider;                                    // 0x0090(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKDataStore_GameSearchBase");
		return ptr;
	}


	bool HasExistingSearchResults();
	bool HasOutstandingQueries(bool bRestrictCheckToSelf);
	void OnSearchComplete(bool bWasSuccessful);
	bool SubmitGameSearch(unsigned char ControllerIndex, bool bInvalidateExistingSearchResults);
	void Init();
};


// Class UDKBase.UDKEmitCameraEffect
// 0x0008 (0x01E8 - 0x01E0)
class AUDKEmitCameraEffect : public AEmitter
{
public:
	float                                              DistFromCamera;                                           // 0x01E0(0x0004) (Edit)
	class AUDKPlayerController*                        Cam;                                                      // 0x01E4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKEmitCameraEffect");
		return ptr;
	}


	void UpdateLocation(float CamFOVDeg, struct FVector* CamLoc, struct FRotator* CamRot);
	void RegisterCamera(class AUDKPlayerController* inCam);
	void Destroyed();
	void PostBeginPlay();
};


// Class UDKBase.UDKEmitterPool
// 0x000C (0x0244 - 0x0238)
class AUDKEmitterPool : public AEmitterPool
{
public:
	TArray<struct FAttachedExplosionLight>             RelativeExplosionLights;                                  // 0x0238(0x000C) (Component, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKEmitterPool");
		return ptr;
	}


	class UUDKExplosionLight* SpawnExplosionLight(class UClass* LightClass, const struct FVector& SpawnLocation, class AActor* AttachToActor);
	void OnExplosionLightFinished(class UUDKExplosionLight* Light);
	class UParticleSystemComponent* SpawnEmitter(class UParticleSystem* EmitterTemplate, const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation, class AActor* AttachToActor, class AActor* InInstigator, int MaxDLEPooledReuses, bool bInheritScaleFromBase);
};


// Class UDKBase.UDKExplosionLight
// 0x0028 (0x0220 - 0x01F8)
class UUDKExplosionLight : public UPointLightComponent
{
public:
	unsigned long                                      bCheckFrameRate : 1;                                      // 0x01F8(0x0004)
	unsigned long                                      bInitialized : 1;                                         // 0x01F8(0x0004)
	float                                              HighDetailFrameTime;                                      // 0x01FC(0x0004)
	float                                              Lifetime;                                                 // 0x0200(0x0004)
	int                                                TimeShiftIndex;                                           // 0x0204(0x0004)
	TArray<struct FLightValues>                        TimeShift;                                                // 0x0208(0x000C) (Edit, NeedCtorLink)
	struct FScriptDelegate                             __OnLightFinished__Delegate;                              // 0x0214(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKExplosionLight");
		return ptr;
	}


	void OnLightFinished(class UUDKExplosionLight* Light);
	void ResetLight();
};


// Class UDKBase.UDKForcedDirectionVolume
// 0x0024 (0x0264 - 0x0240)
class AUDKForcedDirectionVolume : public APhysicsVolume
{
public:
	class UClass*                                      TypeToForce;                                              // 0x0240(0x0004) (Edit)
	unsigned long                                      bIgnoreHoverboards : 1;                                   // 0x0244(0x0004) (Edit)
	unsigned long                                      bDenyExit : 1;                                            // 0x0244(0x0004) (Edit)
	unsigned long                                      bBlockPawns : 1;                                          // 0x0244(0x0004) (Edit)
	unsigned long                                      bBlockSpectators : 1;                                     // 0x0244(0x0004) (Edit)
	class UArrowComponent*                             Arrow;                                                    // 0x0248(0x0004) (Edit, Const, ExportObject, Component, EditInline)
	struct FVector                                     ArrowDirection;                                           // 0x024C(0x000C)
	TArray<class AUDKVehicle*>                         TouchingVehicles;                                         // 0x0258(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKForcedDirectionVolume");
		return ptr;
	}


	bool StopsProjectile(class AProjectile* P);
	void UnTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void ActorEnteredVolume(class AActor* Other);
	void PostBeginPlay();
};


// Class UDKBase.UDKGameInteraction
// 0x0004 (0x016C - 0x0168)
class UUDKGameInteraction : public UUIInteraction
{
public:
	int                                                BlockUIInputSemaphore;                                    // 0x0168(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKGameInteraction");
		return ptr;
	}


	void NotifyGameSessionEnded();
	void BlockUIInput(bool bBlock);
	void ClearUIInputBlocks();
	bool ShouldProcessUIInput();
};


// Class UDKBase.UDKGameObjective
// 0x0031 (0x02DD - 0x02AC)
class AUDKGameObjective : public ANavigationPoint
{
public:
	TArray<class ANavigationPoint*>                    ShootSpots;                                               // 0x02AC(0x000C) (NeedCtorLink)
	unsigned long                                      bAllowOnlyShootable : 1;                                  // 0x02B8(0x0004)
	unsigned long                                      bUnderAttack : 1;                                         // 0x02B8(0x0004) (Net)
	struct FVector                                     HUDLocation;                                              // 0x02BC(0x000C)
	class UTexture2D*                                  IconHudTexture;                                           // 0x02C8(0x0004) (Const)
	struct FTextureCoordinates                         IconCoords;                                               // 0x02CC(0x0010)
	unsigned char                                      DefenderTeamIndex;                                        // 0x02DC(0x0001) (Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKGameObjective");
		return ptr;
	}


	unsigned char GetTeamNum();
	void DrawIcon(class UCanvas* Canvas, const struct FVector& IconLocation, float IconWidth, float IconAlpha, class AUDKPlayerController* PlayerOwner, const struct FLinearColor& DrawColor);
	void SetHUDLocation(const struct FVector& NewHUDLocation);
	void TriggerFlagEvent(const struct FName& EventType, class AController* EventInstigator);
	bool BotNearObjective(class AAIController* C);
	class AActor* GetBestViewTarget();
	void ObjectiveChanged();
};


// Class UDKBase.UDKGameSettingsCommon
// 0x0000 (0x0110 - 0x0110)
class UUDKGameSettingsCommon : public UOnlineGameSettings
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKGameSettingsCommon");
		return ptr;
	}


	struct FString STATIC_BlobToString(struct FString* InBlob);
	bool STATIC_StringToBlob(struct FString* InString, struct FString* OutBlob);
};


// Class UDKBase.UDKGameViewportClient
// 0x000C (0x0134 - 0x0128)
class UUDKGameViewportClient : public UGameViewportClient
{
public:
	struct FString                                     HintLocFileName;                                          // 0x0128(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKGameViewportClient");
		return ptr;
	}


	struct FString LoadRandomLocalizedHintMessage(const struct FString& Category1Name, const struct FString& Category2Name);
};


// Class UDKBase.UDKHUD
// 0x0044 (0x058C - 0x0548)
class AUDKHUD : public AMobileHUD
{
public:
	class UFont*                                       GlowFonts[0x2];                                           // 0x0548(0x0004)
	float                                              PulseDuration;                                            // 0x0550(0x0004)
	float                                              PulseSplit;                                               // 0x0554(0x0004)
	float                                              PulseMultiplier;                                          // 0x0558(0x0004)
	struct FFontRenderInfo                             TextRenderInfo;                                           // 0x055C(0x0028)
	class UFont*                                       ConsoleIconFont;                                          // 0x0584(0x0004)
	class UFont*                                       BindTextFont;                                             // 0x0588(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKHUD");
		return ptr;
	}


	void STATIC_TranslateBindToFont(const struct FString& InBindStr, class UFont** DrawFont, struct FString* OutBindStr);
	void DrawGlowText(const struct FString& Text, float X, float Y, float MaxHeightInPixels, float PulseTime, bool bRightJustified);
};


// Class UDKBase.UDKJumpPad
// 0x0020 (0x02CC - 0x02AC)
class AUDKJumpPad : public ANavigationPoint
{
public:
	struct FVector                                     JumpVelocity;                                             // 0x02AC(0x000C)
	class APathNode*                                   JumpTarget;                                               // 0x02B8(0x0004) (Edit)
	class USoundCue*                                   JumpSound;                                                // 0x02BC(0x0004) (Edit)
	float                                              JumpTime;                                                 // 0x02C0(0x0004) (Edit)
	float                                              JumpAirControl;                                           // 0x02C4(0x0004) (Edit)
	class UAudioComponent*                             JumpAmbientSound;                                         // 0x02C8(0x0004) (ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKJumpPad");
		return ptr;
	}


	bool SuggestMovePreparation(class APawn* Other);
	void PostTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
};


// Class UDKBase.UDKKActorBreakable
// 0x0038 (0x0300 - 0x02C8)
class AUDKKActorBreakable : public AKActor
{
public:
	unsigned long                                      bHasHealth : 1;                                           // 0x02C8(0x0004) (Edit)
	unsigned long                                      bDamageOnEncroachment : 1;                                // 0x02C8(0x0004) (Edit)
	unsigned long                                      bResetDOEWhenAsleep : 1;                                  // 0x02C8(0x0004) (Edit)
	unsigned long                                      bTakeDamageOnEncroachment : 1;                            // 0x02C8(0x0004) (Edit)
	unsigned long                                      bBreakWhenCausingDamage : 1;                              // 0x02C8(0x0004) (Edit)
	unsigned long                                      bBroken : 1;                                              // 0x02C8(0x0004) (Net)
	int                                                Health;                                                   // 0x02CC(0x0004) (Edit)
	int                                                EncroachDamage_Other;                                     // 0x02D0(0x0004) (Edit)
	int                                                EncroachDamage_Self;                                      // 0x02D4(0x0004) (Edit)
	class UClass*                                      DmgTypeClass;                                             // 0x02D8(0x0004) (Edit)
	int                                                DOEResetThreshold;                                        // 0x02DC(0x0004) (Edit)
	class UParticleSystem*                             BrokenTemplate;                                           // 0x02E0(0x0004) (Edit)
	class AController*                                 InstigatorController;                                     // 0x02E4(0x0004)
	struct FScriptDelegate                             __OnBreakApart__Delegate;                                 // 0x02E8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnEncroach__Delegate;                                   // 0x02F4(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKKActorBreakable");
		return ptr;
	}


	void ReplicatedEvent(const struct FName& VarName);
	void BreakApart();
	bool EncroachingOn(class AActor* Other);
	void TakeDamage(float Damage, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	bool OnEncroach(class AActor* Other);
	void OnBreakApart();
};


// Class UDKBase.UDKMapInfo
// 0x0004 (0x0040 - 0x003C)
class UUDKMapInfo : public UMapInfo
{
public:
	float                                              VisibilityModifier;                                       // 0x003C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKMapInfo");
		return ptr;
	}

};


// Class UDKBase.UDKMapMusicInfo
// 0x00A0 (0x00DC - 0x003C)
class UUDKMapMusicInfo : public UObject
{
public:
	struct FMusicForAMap                               MapMusic;                                                 // 0x003C(0x0064) (Edit)
	struct FStingersForAMap                            MapStingers;                                              // 0x00A0(0x003C) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKMapMusicInfo");
		return ptr;
	}

};


// Class UDKBase.UDKParticleSystemComponent
// 0x0014 (0x0350 - 0x033C)
class UUDKParticleSystemComponent : public UParticleSystemComponent
{
public:
	float                                              FOV;                                                      // 0x033C(0x0004) (Const)
	unsigned long                                      bHasSavedScale3D : 1;                                     // 0x0340(0x0004) (Const)
	struct FVector                                     SavedScale3D;                                             // 0x0344(0x000C) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKParticleSystemComponent");
		return ptr;
	}


	void SetFOV(float NewFOV);
};


// Class UDKBase.UDKPawn
// 0x01DC (0x0644 - 0x0468)
class AUDKPawn : public AGamePawn
{
public:
	unsigned long                                      bReadyToDoubleJump : 1;                                   // 0x0468(0x0004)
	unsigned long                                      bRequiresDoubleJump : 1;                                  // 0x0468(0x0004)
	unsigned long                                      bCanDoubleJump : 1;                                       // 0x0468(0x0004)
	unsigned long                                      bNoJumpAdjust : 1;                                        // 0x0468(0x0004)
	unsigned long                                      bIsHoverboardAnimPawn : 1;                                // 0x0468(0x0004)
	unsigned long                                      bFeigningDeath : 1;                                       // 0x0468(0x0004) (Net)
	unsigned long                                      bNotifyStopFalling : 1;                                   // 0x0468(0x0004)
	unsigned long                                      bIsInvisible : 1;                                         // 0x0468(0x0004) (Net)
	unsigned long                                      bSmoothNetUpdates : 1;                                    // 0x0468(0x0004)
	unsigned long                                      bPuttingDownWeapon : 1;                                   // 0x0468(0x0004) (Net)
	unsigned long                                      bPlayingFeignDeathRecovery : 1;                           // 0x0468(0x0004)
	unsigned long                                      bCanPlayFallingImpacts : 1;                               // 0x0468(0x0004)
	unsigned long                                      bEnableFootPlacement : 1;                                 // 0x0468(0x0004)
	unsigned long                                      bPostRenderOtherTeam : 1;                                 // 0x0468(0x0004)
	unsigned long                                      bBlendOutTakeHitPhysics : 1;                              // 0x0468(0x0004)
	unsigned long                                      bUpdateEyeheight : 1;                                     // 0x0468(0x0004)
	unsigned long                                      bTearOffGibs : 1;                                         // 0x0468(0x0004) (Net)
	float                                              MaxDoubleJumpHeight;                                      // 0x046C(0x0004)
	int                                                MultiJumpRemaining;                                       // 0x0470(0x0004)
	int                                                MaxMultiJump;                                             // 0x0474(0x0004)
	int                                                MultiJumpBoost;                                           // 0x0478(0x0004)
	float                                              CustomGravityScaling;                                     // 0x047C(0x0004) (Net)
	struct FPlayEmoteInfo                              EmoteRepInfo;                                             // 0x0480(0x0010) (Net)
	float                                              LastEmoteTime;                                            // 0x0490(0x0004)
	float                                              MinTimeBetweenEmotes;                                     // 0x0494(0x0004)
	unsigned char                                      BigTeleportCount;                                         // 0x0498(0x0001) (Net)
	unsigned char                                      WeaponOverlayFlags;                                       // 0x0499(0x0001) (Net)
	unsigned char                                      UnknownData00[0x2];                                       // 0x049A(0x0002) MISSED OFFSET
	struct FUTTakeHitInfo                              LastTakeHitInfo;                                          // 0x049C(0x0028) (Net)
	float                                              LastTakeHitTimeout;                                       // 0x04C4(0x0004)
	float                                              FireRateMultiplier;                                       // 0x04C8(0x0004) (Net)
	float                                              HeadScale;                                                // 0x04CC(0x0004) (Net)
	float                                              MaxSmoothNetUpdateDist;                                   // 0x04D0(0x0004)
	float                                              NoSmoothNetUpdateDist;                                    // 0x04D4(0x0004)
	float                                              SmoothNetUpdateTime;                                      // 0x04D8(0x0004)
	struct FVector                                     MeshTranslationOffset;                                    // 0x04DC(0x000C)
	struct FVector                                     DefaultMeshTranslation;                                   // 0x04E8(0x000C) (Transient)
	float                                              OldZ;                                                     // 0x04F4(0x0004)
	class UAudioComponent*                             PawnAmbientSound;                                         // 0x04F8(0x0004) (ExportObject, Component, EditInline)
	class USoundCue*                                   PawnAmbientSoundCue;                                      // 0x04FC(0x0004) (Net)
	struct FDrivenWeaponPawnInfo                       DrivenWeaponPawn;                                         // 0x0500(0x000C) (Net)
	class UAudioComponent*                             WeaponAmbientSound;                                       // 0x050C(0x0004) (ExportObject, Component, EditInline)
	class USoundCue*                                   WeaponAmbientSoundCue;                                    // 0x0510(0x0004) (Net)
	class UMaterial*                                   ReplicatedBodyMaterial;                                   // 0x0514(0x0004) (Net)
	TArray<class UMaterialInstanceConstant*>           BodyMaterialInstances;                                    // 0x0518(0x000C) (NeedCtorLink)
	class UMaterialInterface*                          OverlayMaterialInstance;                                  // 0x0524(0x0004) (Net)
	class USkelControlSingleBone*                      RootRotControl;                                           // 0x0528(0x0004)
	class UAnimNodeAimOffset*                          AimNode;                                                  // 0x052C(0x0004)
	class UGameSkelCtrl_Recoil*                        GunRecoilNode;                                            // 0x0530(0x0004)
	class UGameSkelCtrl_Recoil*                        LeftRecoilNode;                                           // 0x0534(0x0004)
	class UGameSkelCtrl_Recoil*                        RightRecoilNode;                                          // 0x0538(0x0004)
	TArray<class AUDKBot*>                             Trackers;                                                 // 0x053C(0x000C) (NeedCtorLink)
	float                                              BodyMatFadeDuration;                                      // 0x0548(0x0004)
	struct FLinearColor                                CurrentBodyMatColor;                                      // 0x054C(0x0010)
	float                                              RemainingBodyMatDuration;                                 // 0x055C(0x0004)
	float                                              ClientBodyMatDuration;                                    // 0x0560(0x0004) (Net)
	struct FLinearColor                                BodyMatColor;                                             // 0x0564(0x0010)
	struct FRotator                                    CompressedBodyMatColor;                                   // 0x0574(0x000C) (Net)
	float                                              StartFallImpactTime;                                      // 0x0580(0x0004)
	struct FName                                       TorsoBoneName;                                            // 0x0584(0x0008)
	class USoundCue*                                   FallImpactSound;                                          // 0x058C(0x0004)
	float                                              FallSpeedThreshold;                                       // 0x0590(0x0004)
	class UStaticMeshComponent*                        BlobShadow;                                               // 0x0594(0x0004) (ExportObject, Component, EditInline)
	class USkeletalMeshComponent*                      OverlayMesh;                                              // 0x0598(0x0004) (ExportObject, Component, EditInline)
	struct FName                                       LeftFootBone;                                             // 0x059C(0x0008)
	struct FName                                       RightFootBone;                                            // 0x05A4(0x0008)
	struct FName                                       LeftFootControlName;                                      // 0x05AC(0x0008)
	struct FName                                       RightFootControlName;                                     // 0x05B4(0x0008)
	float                                              BaseTranslationOffset;                                    // 0x05BC(0x0004)
	float                                              CrouchTranslationOffset;                                  // 0x05C0(0x0004)
	float                                              OldLocationZ;                                             // 0x05C4(0x0004)
	float                                              ZSmoothingRate;                                           // 0x05C8(0x0004) (Const)
	float                                              MaxFootPlacementDistSquared;                              // 0x05CC(0x0004)
	class USkelControlFootPlacement*                   LeftLegControl;                                           // 0x05D0(0x0004)
	class USkelControlFootPlacement*                   RightLegControl;                                          // 0x05D4(0x0004)
	class USkelControlLimb*                            LeftHandIK;                                               // 0x05D8(0x0004)
	class USkelControlLimb*                            RightHandIK;                                              // 0x05DC(0x0004)
	struct FName                                       DamageParameterName;                                      // 0x05E0(0x0008)
	struct FName                                       SaturationParameterName;                                  // 0x05E8(0x0008)
	float                                              LastPostRenderTraceTime;                                  // 0x05F0(0x0004)
	float                                              TeamBeaconMaxDist;                                        // 0x05F4(0x0004) (Edit)
	float                                              StartedFallingTime;                                       // 0x05F8(0x0004)
	float                                              SlopeBoostFriction;                                       // 0x05FC(0x0004)
	class UAnimNodeAimOffset*                          FlyingDirOffset;                                          // 0x0600(0x0004)
	int                                                MaxLeanRoll;                                              // 0x0604(0x0004)
	float                                              FeignDeathPhysicsBlendOutSpeed;                           // 0x0608(0x0004)
	float                                              SwimmingZOffset;                                          // 0x060C(0x0004) (Edit)
	float                                              SwimmingZOffsetSpeed;                                     // 0x0610(0x0004) (Edit)
	float                                              CrouchMeshZOffset;                                        // 0x0614(0x0004)
	float                                              TakeHitPhysicsBlendOutSpeed;                              // 0x0618(0x0004)
	class UUDKSkeletalMeshComponent*                   ArmsMesh[0x2];                                            // 0x061C(0x0004) (ExportObject, Component, EditInline)
	int                                                RootYaw;                                                  // 0x0624(0x0004)
	float                                              RootYawSpeed;                                             // 0x0628(0x0004)
	int                                                MaxYawAim;                                                // 0x062C(0x0004) (Edit)
	struct FVector2D                                   CurrentSkelAim;                                           // 0x0630(0x0008)
	struct FVector                                     HUDLocation;                                              // 0x0638(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKPawn");
		return ptr;
	}


	void PostBeginPlay();
	void StuckFalling();
	void UpdateEyeHeight(float DeltaTime);
	void TakeHitBlendedOut();
	void StartFeignDeathRecoveryAnim();
	void SetHandIKEnabled(bool bEnabled);
	void SetWeaponAttachmentVisibility(bool bAttachmentVisible);
	void NativePostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	void SetHUDLocation(const struct FVector& NewHUDLocation);
	bool SuggestJumpVelocity(const struct FVector& Destination, const struct FVector& Start, bool bRequireFallLanding, struct FVector* JumpVelocity);
	void StartCrouch(float HeightAdjust);
	void EndCrouch(float HeightAdjust);
	void StoppedFalling();
	void HoldGameObject(class AUDKCarriedObject* UDKGameObj);
	bool IsInvisible();
	struct FVector GetTargetLocation(class AActor* RequestedBy, bool bRequestAlternateLoc);
	void EnsureOverlayComponentLast();
	void RestorePreRagdollCollisionComponent();
	void GetBoundingCylinder(float* CollisionRadius, float* CollisionHeight);
};


// Class UDKBase.UDKPickupFactory
// 0x00A4 (0x036C - 0x02C8)
class AUDKPickupFactory : public APickupFactory
{
public:
	unsigned long                                      bIsRespawning : 1;                                        // 0x02C8(0x0004) (Net)
	unsigned long                                      bPulseBase : 1;                                           // 0x02C8(0x0004) (Net)
	unsigned long                                      bIsDisabled : 1;                                          // 0x02C8(0x0004) (Net)
	unsigned long                                      bFloatingPickup : 1;                                      // 0x02C8(0x0004)
	unsigned long                                      bRandomStart : 1;                                         // 0x02C8(0x0004)
	unsigned long                                      bRotatingPickup : 1;                                      // 0x02C8(0x0004)
	unsigned long                                      bUpdatingPickup : 1;                                      // 0x02C8(0x0004)
	unsigned long                                      bDoVisibilityFadeIn : 1;                                  // 0x02C8(0x0004)
	class UStaticMeshComponent*                        BaseMesh;                                                 // 0x02CC(0x0004) (ExportObject, Transient, Component, EditInline)
	class UMaterialInstanceConstant*                   BaseMaterialInstance;                                     // 0x02D0(0x0004)
	struct FLinearColor                                BaseBrightEmissive;                                       // 0x02D4(0x0010)
	struct FLinearColor                                BaseDimEmissive;                                          // 0x02E4(0x0010)
	float                                              BasePulseRate;                                            // 0x02F4(0x0004)
	float                                              BasePulseTime;                                            // 0x02F8(0x0004)
	float                                              PulseThreshold;                                           // 0x02FC(0x0004)
	struct FLinearColor                                BaseTargetEmissive;                                       // 0x0300(0x0010)
	struct FLinearColor                                BaseEmissive;                                             // 0x0310(0x0010)
	struct FName                                       BaseMaterialParamName;                                    // 0x0320(0x0008)
	float                                              BobTimer;                                                 // 0x0328(0x0004)
	float                                              BobOffset;                                                // 0x032C(0x0004)
	float                                              BobSpeed;                                                 // 0x0330(0x0004)
	float                                              BobBaseOffset;                                            // 0x0334(0x0004)
	float                                              YawRotationRate;                                          // 0x0338(0x0004)
	struct FVector                                     PivotTranslation;                                         // 0x033C(0x000C)
	struct FName                                       VisibilityParamName;                                      // 0x0348(0x0008)
	class UMaterialInstanceConstant*                   MIC_Visibility;                                           // 0x0350(0x0004)
	class UMaterialInstanceConstant*                   MIC_VisibilitySecondMaterial;                             // 0x0354(0x0004)
	class UParticleSystemComponent*                    Glow;                                                     // 0x0358(0x0004) (ExportObject, Component, EditInline)
	struct FName                                       GlowEmissiveParam;                                        // 0x035C(0x0008)
	class UPrimitiveComponent*                         Spinner;                                                  // 0x0364(0x0004) (ExportObject, Component, EditInline)
	class UUDKParticleSystemComponent*                 SpinningParticleEffects;                                  // 0x0368(0x0004) (ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKPickupFactory");
		return ptr;
	}


	void SetPickupHidden();
	void SetPickupVisible();
};


// Class UDKBase.UDKPlayerController
// 0x02D8 (0x08F0 - 0x0618)
class AUDKPlayerController : public AGamePlayerController
{
public:
	class UCameraAnimInst*                             CameraAnimPlayer;                                         // 0x0618(0x0004)
	class AUDKEmitCameraEffect*                        CameraEffect;                                             // 0x061C(0x0004)
	unsigned long                                      bDedicatedServerSpectator : 1;                            // 0x0620(0x0004)
	unsigned long                                      bAcuteHearing : 1;                                        // 0x0620(0x0004)
	unsigned long                                      bAlwaysHearFromPawnLocation : 1;                          // 0x0620(0x0004)
	unsigned long                                      bConsolePlayer : 1;                                       // 0x0620(0x0004)
	unsigned long                                      bPulseTeamColor : 1;                                      // 0x0620(0x0004)
	unsigned long                                      bUsePhysicsRotation : 1;                                  // 0x0620(0x0004)
	struct FVector                                     ShakeOffset;                                              // 0x0624(0x000C)
	struct FRotator                                    ShakeRot;                                                 // 0x0630(0x000C)
	struct FPostProcessSettings                        CamOverridePostProcess;                                   // 0x063C(0x0150) (NeedCtorLink)
	struct FPostProcessSettings                        PostProcessModifier;                                      // 0x078C(0x0150) (NeedCtorLink)
	TArray<class AActor*>                              PotentiallyHiddenActors;                                  // 0x08DC(0x000C) (NeedCtorLink)
	float                                              VehicleCheckRadiusScaling;                                // 0x08E8(0x0004)
	float                                              PulseTimer;                                               // 0x08EC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKPlayerController");
		return ptr;
	}


	class APawn* GetTargetAdhesionFrictionTarget(float MaxDistance, struct FVector* CamLoc, struct FRotator* CamRot);
	void ClearCameraEffect();
	void ClientSpawnCameraEffect(class UClass* CameraEffectClass);
	void RemoveCameraEffect(class AUDKEmitCameraEffect* CamEmitter);
	bool IsMouseAvailable();
	bool IsKeyboardAvailable();
	void SetGamma(float GammaValue);
};


// Class UDKBase.UDKPlayerInput
// 0x0000 (0x04A0 - 0x04A0)
class UUDKPlayerInput : public UMobilePlayerInput
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKPlayerInput");
		return ptr;
	}


	struct FString GetUDKBindNameFromCommand(const struct FString& BindCommand);
};


// Class UDKBase.UDKProfileSettings
// 0x0000 (0x008C - 0x008C)
class UUDKProfileSettings : public UOnlineProfileSettings
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKProfileSettings");
		return ptr;
	}


	void STATIC_ResetKeysToDefault(class ULocalPlayer* InPlayerOwner);
	void ResetToDefault(int ProfileId);
};


// Class UDKBase.UDKProjectile
// 0x003C (0x024C - 0x0210)
class AUDKProjectile : public AProjectile
{
public:
	unsigned long                                      bWideCheck : 1;                                           // 0x0210(0x0004) (Net)
	unsigned long                                      bShuttingDown : 1;                                        // 0x0210(0x0004)
	unsigned long                                      bCheckProjectileLight : 1;                                // 0x0210(0x0004)
	unsigned long                                      bNotBlockedByShield : 1;                                  // 0x0210(0x0004)
	float                                              CheckRadius;                                              // 0x0214(0x0004)
	float                                              AccelRate;                                                // 0x0218(0x0004)
	class AActor*                                      SeekTarget;                                               // 0x021C(0x0004) (Net)
	float                                              BaseTrackingStrength;                                     // 0x0220(0x0004)
	float                                              HomingTrackingStrength;                                   // 0x0224(0x0004)
	struct FVector                                     InitialDir;                                               // 0x0228(0x000C) (Net)
	float                                              LastLockWarningTime;                                      // 0x0234(0x0004)
	float                                              LockWarningInterval;                                      // 0x0238(0x0004)
	float                                              TerminalVelocity;                                         // 0x023C(0x0004)
	float                                              Buoyancy;                                                 // 0x0240(0x0004)
	float                                              CustomGravityScaling;                                     // 0x0244(0x0004)
	class AVehicle*                                    InstigatorBaseVehicle;                                    // 0x0248(0x0004) (Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKProjectile");
		return ptr;
	}


	void CreateProjectileLight();
	float GetTerminalVelocity();
};


// Class UDKBase.UDKScout
// 0x0014 (0x0504 - 0x04F0)
class AUDKScout : public AScout
{
public:
	unsigned long                                      bRequiresDoubleJump : 1;                                  // 0x04F0(0x0004)
	float                                              MaxDoubleJumpHeight;                                      // 0x04F4(0x0004)
	class UClass*                                      PrototypePawnClass;                                       // 0x04F8(0x0004)
	struct FName                                       SizePersonFindName;                                       // 0x04FC(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKScout");
		return ptr;
	}


	bool SuggestJumpVelocity(const struct FVector& Destination, const struct FVector& Start, bool bRequireFallLanding, struct FVector* JumpVelocity);
};


// Class UDKBase.UDKScriptedNavigationPoint
// 0x0004 (0x02B0 - 0x02AC)
class AUDKScriptedNavigationPoint : public ANavigationPoint
{
public:
	unsigned long                                      bScriptSpecifyEndAnchor : 1;                              // 0x02AC(0x0004)
	unsigned long                                      bScriptNotifyAnchorFindingResult : 1;                     // 0x02AC(0x0004)
	unsigned long                                      bAnchorMustBeReachable : 1;                               // 0x02AC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKScriptedNavigationPoint");
		return ptr;
	}


	void NotifyAnchorFindingResult(class ANavigationPoint* EndAnchor, class APawn* RouteFinder);
	class ANavigationPoint* SpecifyEndAnchor(class APawn* RouteFinder);
};


// Class UDKBase.UDKSkeletalMeshComponent
// 0x000C (0x0628 - 0x061C)
class UUDKSkeletalMeshComponent : public USkeletalMeshComponent
{
public:
	float                                              FOV;                                                      // 0x061C(0x0004) (Edit, Const)
	unsigned long                                      bForceLoadTextures : 1;                                   // 0x0620(0x0004)
	float                                              ClearStreamingTime;                                       // 0x0624(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKSkeletalMeshComponent");
		return ptr;
	}


	void SetFOV(float NewFOV);
	void PreloadTextures(bool bForcePreload, float ClearTime);
};


// Class UDKBase.UDKTeamOwnedInfo
// 0x0004 (0x01D8 - 0x01D4)
class AUDKTeamOwnedInfo : public AReplicationInfo
{
public:
	class ATeamInfo*                                   Team;                                                     // 0x01D4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKTeamOwnedInfo");
		return ptr;
	}


	unsigned char GetTeamNum();
};


// Class UDKBase.UDKSquadAI
// 0x0038 (0x0210 - 0x01D8)
class AUDKSquadAI : public AUDKTeamOwnedInfo
{
public:
	class AUDKGameObjective*                           SquadObjective;                                           // 0x01D8(0x0004) (Net)
	class ANavigationPoint*                            RouteObjective;                                           // 0x01DC(0x0004)
	TArray<class ANavigationPoint*>                    ObjectiveRouteCache;                                      // 0x01E0(0x000C) (NeedCtorLink)
	TArray<class ANavigationPoint*>                    PreviousObjectiveRouteCache;                              // 0x01EC(0x000C) (NeedCtorLink)
	class AUDKBot*                                     PendingSquadRouteMaker;                                   // 0x01F8(0x0004)
	int                                                SquadRouteIteration;                                      // 0x01FC(0x0004)
	TArray<struct FAlternateRoute>                     SquadRoutes;                                              // 0x0200(0x000C) (NeedCtorLink)
	int                                                MaxSquadRoutes;                                           // 0x020C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKSquadAI");
		return ptr;
	}

};


// Class UDKBase.UDKTeamPlayerStart
// 0x0010 (0x02CC - 0x02BC)
class AUDKTeamPlayerStart : public APlayerStart
{
public:
	unsigned char                                      TeamNumber;                                               // 0x02BC(0x0001) (Deprecated)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02BD(0x0003) MISSED OFFSET
	TArray<class UTexture2D*>                          TeamSprites;                                              // 0x02C0(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKTeamPlayerStart");
		return ptr;
	}

};


// Class UDKBase.UDKTeleporterBase
// 0x0028 (0x02FC - 0x02D4)
class AUDKTeleporterBase : public ATeleporter
{
public:
	class USceneCaptureComponent*                      PortalCaptureComponent;                                   // 0x02D4(0x0004) (Edit, ExportObject, EditConst, Component, EditInline)
	class UTextureRenderTarget2D*                      TextureTarget;                                            // 0x02D8(0x0004)
	int                                                TextureResolutionX;                                       // 0x02DC(0x0004) (Edit)
	int                                                TextureResolutionY;                                       // 0x02E0(0x0004) (Edit)
	class AActor*                                      PortalViewTarget;                                         // 0x02E4(0x0004)
	class UMaterialInterface*                          PortalMaterial;                                           // 0x02E8(0x0004)
	class UMaterialInstanceConstant*                   PortalMaterialInstance;                                   // 0x02EC(0x0004)
	struct FName                                       PortalTextureParameter;                                   // 0x02F0(0x0008)
	class USoundCue*                                   TeleportingSound;                                         // 0x02F8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKTeleporterBase");
		return ptr;
	}


	bool Accept(class AActor* Incoming, class AActor* Source);
	void InitializePortalEffect(class AActor* Dest);
	void PostBeginPlay();
};


// Class UDKBase.UDKTrajectoryReachSpec
// 0x0000 (0x0090 - 0x0090)
class UUDKTrajectoryReachSpec : public UAdvancedReachSpec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKTrajectoryReachSpec");
		return ptr;
	}

};


// Class UDKBase.UDKJumpPadReachSpec
// 0x0000 (0x0090 - 0x0090)
class UUDKJumpPadReachSpec : public UUDKTrajectoryReachSpec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UDKBase.UDKJumpPadReachSpec");
		return ptr;
	}

};


// Class UDKBase.UDKUIDataProvider_SearchResult
// 0x002C (0x0094 - 0x0068)
class UUDKUIDataProvider_SearchResult : public UUIDataProvider_Settings
{
public:
	struct FName                                       PlayerRatioTag;                                           // 0x0068(0x0008) (Const)
	struct FName                                       GameModeFriendlyNameTag;                                  // 0x0070(0x0008) (Const)
	struct FName                                       ServerFlagsTag;                                           // 0x0078(0x0008) (Const)
	struct FName                                       MapNameTag;                                               // 0x0080(0x0008) (Const)
	struct FString                                     IconFontPathName;                                         // 0x0088(0x000C) (Const, NeedCtorLink)

	static UClass* StaticClass()
	{
