#pragma once

// Hawken (1.5.3.142579) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class HawkenGame.HawkenActorFactoryAI
// 0x0014 (0x00A4 - 0x0090)
class UHawkenActorFactoryAI : public UActorFactoryAI
{
public:
	class UR_NPC_Template*                             TemplateToBuildNpcFrom;                                   // 0x0090(0x0004) (Edit)
	TEnumAsByte<EDefaultNpcBehavior>                   Behavior;                                                 // 0x0094(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0095(0x0003) MISSED OFFSET
	TArray<class UETQTemplate*>                        ETQsNeeded;                                               // 0x0098(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.HawkenActorFactoryAI");
		return ptr;
	}


	void PostCreateActor(class AActor* NewActor, class USeqAct_ActorFactory* ActorFactoryData);
};


// Class HawkenGame.HawkenTypes
// 0x003C (0x0078 - 0x003C)
class UHawkenTypes : public UObject
{
public:
	struct FScriptDelegate                             __OnReadLegacyStatsComplete__Delegate;                    // 0x003C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnLoginDialogClosed__Delegate;                          // 0x0048(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnMessageDialogClose__Delegate;                         // 0x0054(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnWaitingDialogClosed__Delegate;                        // 0x0060(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnInputCaptured__Delegate;                              // 0x006C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.HawkenTypes");
		return ptr;
	}


	void OnInputCaptured(int InDialogId, const struct FName& ButtonName);
	void OnWaitingDialogClosed(int InDialogId, bool bCancelled);
	void OnMessageDialogClose(int InDialogId, TEnumAsByte<EMessageDialogButton> InButton);
	void OnLoginDialogClosed(int InDialogId, const struct FString& InEmail, const struct FString& InPassword, const struct FString& citizenID, bool bCancelled);
	void OnReadLegacyStatsComplete(bool bWasSuccessful, const struct FSOnlineLegacyStats& LegacyStats);
};


// Class HawkenGame.R_Ability_Base
// 0x00C4 (0x0298 - 0x01D4)
class AR_Ability_Base : public AActor
{
public:
	unsigned long                                      bReady : 1;                                               // 0x01D4(0x0004) (Net)
	unsigned long                                      bCanBeActivatedWhenOverheated : 1;                        // 0x01D4(0x0004) (Const)
	unsigned long                                      bInfiniteDuration : 1;                                    // 0x01D4(0x0004) (Const)
	unsigned long                                      bShowAbilityHologram : 1;                                 // 0x01D4(0x0004) (Const)
	unsigned long                                      bPlayLoopingSound : 1;                                    // 0x01D4(0x0004)
	unsigned long                                      bAllowHeavyModeBoost : 1;                                 // 0x01D4(0x0004) (Const)
	float                                              RegenerationSeconds;                                      // 0x01D8(0x0004)
	float                                              ModeActiveTime;                                           // 0x01DC(0x0004)
	float                                              CooldownAdjustPerPoint;                                   // 0x01E0(0x0004) (Const)
	float                                              DurationAdjustPerPoint;                                   // 0x01E4(0x0004) (Const)
	float                                              CooldownModifier;                                         // 0x01E8(0x0004)
	float                                              DurationModifier;                                         // 0x01EC(0x0004)
	TArray<struct FString>                             UpgradeName;                                              // 0x01F0(0x000C) (Const, Localized, NeedCtorLink)
	TArray<struct FString>                             UpgradeDescription;                                       // 0x01FC(0x000C) (Const, Localized, NeedCtorLink)
	class AR_Pawn*                                     RobotOwner;                                               // 0x0208(0x0004) (Net)
	int                                                AbilityUpgradeFlags;                                      // 0x020C(0x0004)
	struct FString                                     AbilityName;                                              // 0x0210(0x000C) (Const, Localized, NeedCtorLink)
	struct FString                                     Description;                                              // 0x021C(0x000C) (Const, Localized, NeedCtorLink)
	class UTexture2D*                                  AbilityIcon;                                              // 0x0228(0x0004) (Const)
	class UTexture2D*                                  AbilityIcon_Small;                                        // 0x022C(0x0004) (Const)
	struct FName                                       AbilityStat;                                              // 0x0230(0x0008) (Const)
	struct FString                                     PropSheetName;                                            // 0x0238(0x000C) (Const, NeedCtorLink)
	TArray<struct FString>                             ValidPropNameList;                                        // 0x0244(0x000C) (Const, NeedCtorLink)
	int                                                PropSheetIdx;                                             // 0x0250(0x0004)
	class USoundCue*                                   SoundActivate;                                            // 0x0254(0x0004) (Const)
	class USoundCue*                                   SoundDeactivate;                                          // 0x0258(0x0004) (Const)
	class USoundCue*                                   SoundTempDeactivate;                                      // 0x025C(0x0004) (Const)
	class USoundCue*                                   SoundReactivate;                                          // 0x0260(0x0004) (Const)
	class USoundCue*                                   ActivateVO;                                               // 0x0264(0x0004) (Const)
	class USoundCue*                                   DeactivateVO;                                             // 0x0268(0x0004) (Const)
	class USoundCue*                                   TempDeactivateVO;                                         // 0x026C(0x0004) (Const)
	class UAudioComponent*                             LoopingSoundComp;                                         // 0x0270(0x0004) (ExportObject, Component, EditInline)
	float                                              OverrideFOV;                                              // 0x0274(0x0004)
	TEnumAsByte<EAbilities>                            AbilityType;                                              // 0x0278(0x0001) (Const)
	TEnumAsByte<EAbilityState>                         PreviousClientState;                                      // 0x0279(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x027A(0x0002) MISSED OFFSET
	struct FName                                       AbilityTrackingName;                                      // 0x027C(0x0008) (Const)
	struct FReplicatedIsActive                         Active;                                                   // 0x0284(0x0008) (Net)
	TArray<class UClass*>                              AbilityClass;                                             // 0x028C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_Ability_Base");
		return ptr;
	}


	bool IsAvailable();
	bool IsTempDeactive();
	bool IsAbilityActive();
	void SetAbilityActiveState(TEnumAsByte<EAbilityState> NewState, float DeactiveTime);
	bool IsHealingOwner();
	void StopLoopingSound(bool bHardEnd);
	void StartLoopingSound();
	void ModifyCurrentAbilityRegen(float PercentOfDefaultToAdd);
	float GetRechargeTimeRemaining();
	float GetModeActiveTime();
	float STATIC_GetDefaultModeActiveTime();
	float GetRegenerationTime();
	float STATIC_GetDefaultRegenerationTime();
	float GetTimeRemaining();
	void RegenAbility();
	bool UpdateThrust(float DeltaTime);
	int AbilityWeaponHand();
	void OnSetCinematicMode(bool bCinematicMode);
	void OnEMPBlast();
	void OnTakeDamage(int Damage);
	void OnHeal();
	void OnBoost();
	void OnFire();
	void OnReactivate();
	void ClientOnTemporaryDeactivate(float DeactiveTime);
	void OnTemporaryDeactivate(float DeactiveTime);
	void ClientOnDeactivate(float forceRegenTime);
	void OnDeactivate(float forceRegenTime);
	void ClientOnActivate();
	bool OnActivate();
	void ResetAbility();
	bool CanActivate();
	void StartRegenTimer(float forceRegenTime);
	void StartAbilityTimer();
	void ReactivateTimer();
	void AbilityTimer();
	void ReplicatedEvent(const struct FName& VarName);
	void SetAbilityDefaults(class UR_ItemDatabaseProps* Props, int upgradeFlags);
	void Tick(float DeltaTime);
	void SetRobotOwner(class AR_Pawn* NewOwner);
};


// Class HawkenGame.R_BaseForcefield
// 0x0020 (0x01F4 - 0x01D4)
class AR_BaseForcefield : public AActor
{
public:
	struct FPointer                                    VfTable_IInterface_NavMeshPathObstacle;                   // 0x01D4(0x0004) (Const, Native, NoExport)
	class UStaticMeshComponent*                        MeshComp;                                                 // 0x01D8(0x0004) (Edit, ExportObject, Component, EditInline)
	class UMaterialInstanceConstant*                   BlockadeMaterialInstance;                                 // 0x01DC(0x0004) (Transient)
	float                                              FadeAmount;                                               // 0x01E0(0x0004)
	unsigned long                                      bObstacleRegistered : 1;                                  // 0x01E4(0x0004) (Transient)
	TArray<struct FVector>                             BoundingShape;                                            // 0x01E8(0x000C) (Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_BaseForcefield");
		return ptr;
	}


	void UnRegisterObstacle();
	void RegisterObstacle();
	void PostBeginPlay();
	void Tick(float DeltaTime);
	bool IsActive();
};


// Class HawkenGame.R_BaseLifter
// 0x008C (0x0260 - 0x01D4)
class AR_BaseLifter : public AActor
{
public:
	int                                                TeamIndex;                                                // 0x01D4(0x0004) (Edit, Net)
	class UAnimNodeSlot*                               DeploySlot;                                               // 0x01D8(0x0004) (Transient)
	unsigned long                                      bIsLifting : 1;                                           // 0x01DC(0x0004) (Transient)
	class UUDKSkeletalMeshComponent*                   LifterMesh;                                               // 0x01E0(0x0004) (Edit, ExportObject, Component, EditInline)
	int                                                CurrentHealth;                                            // 0x01E4(0x0004) (Transient)
	int                                                MaxHealth;                                                // 0x01E8(0x0004)
	float                                              BeamSpawnCooldown;                                        // 0x01EC(0x0004) (Edit)
	float                                              InteractiveRange;                                         // 0x01F0(0x0004) (Const)
	class UStaticMeshComponent*                        TubeMesh;                                                 // 0x01F4(0x0004) (Edit, ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        LifterBaseMesh;                                           // 0x01F8(0x0004) (Edit, ExportObject, Component, EditInline)
	struct FName                                       BaseSocket;                                               // 0x01FC(0x0008)
	struct FName                                       AttachSocket;                                             // 0x0204(0x0008)
	struct FName                                       CollectSocket;                                            // 0x020C(0x0008)
	struct FName                                       ActivateAnim;                                             // 0x0214(0x0008)
	struct FName                                       ReleaseAnim;                                              // 0x021C(0x0008)
	float                                              TransferLevel;                                            // 0x0224(0x0004)
	class USoundCue*                                   BaseLifterSoundUp;                                        // 0x0228(0x0004)
	class USoundCue*                                   BaseLifterSoundDown;                                      // 0x022C(0x0004)
	class USoundCue*                                   EnergyDrainSound;                                         // 0x0230(0x0004)
	class UMaterialInstanceConstant*                   TubeMaterialInstance;                                     // 0x0234(0x0004) (Transient)
	class UMaterialInstanceConstant*                   TubeAlphaMaterialInstance;                                // 0x0238(0x0004) (Transient)
	class UMaterialInstanceConstant*                   LifterMaterialInstance;                                   // 0x023C(0x0004) (Transient)
	class UParticleSystemComponent*                    DrainParticles;                                           // 0x0240(0x0004) (ExportObject, Component, EditInline)
	struct FName                                       DrainSocket;                                              // 0x0244(0x0008) (Edit)
	class UParticleSystem*                             DrainEffect;                                              // 0x024C(0x0004) (Edit)
	float                                              TransferLevelMin;                                         // 0x0250(0x0004) (Edit)
	struct FLifterStateStruct                          LifterInfo;                                               // 0x0254(0x0008) (Net)
	class AR_Pawn*                                     LastActivator;                                            // 0x025C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_BaseLifter");
		return ptr;
	}


	void DisplayDebug(class AHUD* H, float* YL, float* YPos);
	bool Interactive_Activate(class AActor* EventInstigator);
	bool Interactive_IsValidFor(class AActor* A);
	float Interactive_GetMaxInteractiveDist();
	float Interactive_GetMinInteractiveAngle();
	struct FRotator Interactive_GetRotation();
	struct FVector Interactive_GetLocation(const struct FVector& TraceHitLoc);
	class AR_Pawn* GetActivatorPawn(class AActor* Activator);
	class AR_PlayerController* GetActivatorController(class AActor* Activator);
	void Tick(float DeltaTime);
	bool IsNeutralTeamMode();
	bool IsValidTeam(int ActivatorTeamNum);
	bool CanDrain(class AR_Pawn* Activator, TEnumAsByte<EHintType>* FailHint);
	struct FVector GetPlatformPos();
	struct FVector GetCameraFocus();
	void SpawnNewBeam();
	void BeamCooldownTimer();
	void UpdateActivatorMeshLocation();
	struct FVector GetLifterUseLocation();
	void PostBeginPlay();
	void DoneDropping();
	void StopDraining(TEnumAsByte<EHintType> StopHint);
	void StopDrainingEffect();
	void StartDraining();
	void DetachPawn(class AR_Pawn* P);
	void AttachPawn(class AR_Pawn* P);
	void StartLifting();
	void StartWaiting();
	void InitCustomizedMaterial();
	void PostInitAnimTree(class USkeletalMeshComponent* SkelComp);
	bool Activate(class AController* EventInstigator);
	void SetLastActivator(class AR_Pawn* NewValue);
	void SetActivator(class AR_Pawn* ActivatorPawn);
	struct FVector GetHintTestLocation(const struct FVector& TraceHitLoc);
	float GetHintRange();
	TEnumAsByte<EHintType> GetHint(class AR_Pawn* RPawn);
	void ReplicatedEvent(const struct FName& VarName);
	void TakeRadiusDamage(class AController* InstigatedBy, float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HurtOrigin, bool bFullDamage, class AActor* DamageCauser, float DamageFalloffExponent);
	void TakeDamage(float Damage, class AController* InstigatedBy, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
};


// Class HawkenGame.R_BaseReactor
// 0x0004 (0x01D8 - 0x01D4)
class AR_BaseReactor : public AActor
{
public:
	int                                                TeamNum;                                                  // 0x01D4(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_BaseReactor");
		return ptr;
	}


	void TakeDamage(float DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	unsigned char GetTeamNum();
};


// Class HawkenGame.R_BattleShip
// 0x01A0 (0x0374 - 0x01D4)
class AR_BattleShip : public AActor
{
public:
	unsigned char                                      TeamIndex;                                                // 0x01D4(0x0001) (Edit, Net)
	unsigned char                                      UnknownData00[0x3];                                       // 0x01D5(0x0003) MISSED OFFSET
	int                                                NumHomingMissilesFired;                                   // 0x01D8(0x0004) (Edit)
	TArray<float>                                      Spread;                                                   // 0x01DC(0x000C) (Edit, NeedCtorLink)
	float                                              MoveSpeed;                                                // 0x01E8(0x0004) (Net)
	float                                              BaseMoveSpeed;                                            // 0x01EC(0x0004)
	unsigned long                                      bTeamSet : 1;                                             // 0x01F0(0x0004)
	unsigned long                                      pendingDestruction : 1;                                   // 0x01F0(0x0004)
	unsigned long                                      bLaunched : 1;                                            // 0x01F0(0x0004) (Net)
	unsigned long                                      bMoving : 1;                                              // 0x01F0(0x0004) (Net)
	float                                              TravelTimeSeconds;                                        // 0x01F4(0x0004)
	int                                                NumEnergyUnitBlobs;                                       // 0x01F8(0x0004)
	int                                                EnergyUnitsPerBlob;                                       // 0x01FC(0x0004)
	class USkeletalMeshComponent*                      ShipMesh;                                                 // 0x0200(0x0004) (ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        CollisionMesh;                                            // 0x0204(0x0004) (ExportObject, Component, EditInline)
	class UClass*                                      ProjectileClass;                                          // 0x0208(0x0004) (Edit)
	class UClass*                                      TurretClass;                                              // 0x020C(0x0004) (Edit)
	class UClass*                                      EngineClass;                                              // 0x0210(0x0004) (Edit)
	class UParticleSystem*                             JetExhaustEffect;                                         // 0x0214(0x0004) (Edit)
	struct FName                                       JetExhaustSocket[0x3];                                    // 0x0218(0x0008)
	class UParticleSystemComponent*                    JetExhaustPSC[0x3];                                       // 0x0230(0x0004) (ExportObject, Component, EditInline)
	struct FName                                       TurretSocket[0x2];                                        // 0x023C(0x0008)
	class UParticleSystemComponent*                    DamagePSC[0x8];                                           // 0x024C(0x0004) (ExportObject, Component, EditInline)
	int                                                NumDamageEffects;                                         // 0x026C(0x0004)
	class AR_Turret_Battleship*                        SpawnedTurrets[0x2];                                      // 0x0270(0x0004) (Net)
	struct FVector                                     EngineOffset;                                             // 0x0278(0x000C)
	struct FVector                                     EngineOffsetA;                                            // 0x0284(0x000C) (Const)
	struct FVector                                     EngineOffsetB;                                            // 0x0290(0x000C) (Const)
	class AR_BattleShipEngine*                         Engine;                                                   // 0x029C(0x0004) (Net)
	float                                              TravelDistance;                                           // 0x02A0(0x0004) (Net)
	float                                              SplineLength;                                             // 0x02A4(0x0004)
	class UAudioComponent*                             EngineSound;                                              // 0x02A8(0x0004) (ExportObject, Component, EditInline)
	class USoundCue*                                   HornSound;                                                // 0x02AC(0x0004)
	class USoundCue*                                   BattleshipExplosionSound;                                 // 0x02B0(0x0004)
	class USoundCue*                                   BattleshipWarmupSound;                                    // 0x02B4(0x0004)
	class AR_BaseReactor_MA*                           EnemyBase;                                                // 0x02B8(0x0004)
	class UParticleSystem*                             TeamExplosionPS[0x2];                                     // 0x02BC(0x0004)
	class UParticleSystem*                             ShipLaunchEffect;                                         // 0x02C4(0x0004)
	class UParticleSystem*                             DamageEffect[0x8];                                        // 0x02C8(0x0004)
	struct FName                                       DamageSocket[0x8];                                        // 0x02E8(0x0008)
	float                                              DamagePercent[0x8];                                       // 0x0328(0x0004)
	float                                              EffectRestart[0x8];                                       // 0x0348(0x0004)
	struct FCachedSplineInfo                           SplineFollowInfo;                                         // 0x0368(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_BattleShip");
		return ptr;
	}


	void StartShipMovementAfterCooldown();
	void MissileVisualsTimer();
	void DamageEnemyBase();
	void DamageEnemyBattleship();
	int UpdateAttachments(const struct FVector& EngineLocation);
	void Tick(float DeltaTime);
	float GetSplineLength();
	bool FollowSpline();
	void UpdateVelocity(const struct FVector& NewVelocity);
	class ASplineActor* STATIC_GetStartSplineActor(int ShipTeamIndex, class AActor* A);
	class AProjectile* FireProjectileAtEnemyBase();
	void SpawnBattleshipExplosion();
	void TornOff();
	void OnDestroyed(bool bSpawnExplosion);
	float GetTimeToReachBase();
	void OnSpawn(int NewTeamIndex, int BattleShipLevel);
	void UpdateDamageEffect(float ShipDamagePercent, float DeltaTime);
	void ActivateThrusterEffects();
	void DeactivateThrusterEffects();
	void StartMoveTimer();
	void StartEngineTimer();
	void OnLaunch();
	unsigned char GetTeamNum();
	void SetTeam(int NewTeamIndex);
	void SetStartLocation();
	class AR_BaseReactor_MA* FindEnemyBase();
	bool EncroachingOn(class AActor* Other);
	void ReplicatedEvent(const struct FName& VarName);
};


// Class HawkenGame.R_BattleShipEngine
// 0x0024 (0x01F8 - 0x01D4)
class AR_BattleShipEngine : public AActor
{
public:
	unsigned char                                      TeamIndex;                                                // 0x01D4(0x0001) (Edit, Net)
	unsigned char                                      UnknownData00[0x3];                                       // 0x01D5(0x0003) MISSED OFFSET
	class UStaticMeshComponent*                        EngineMesh;                                               // 0x01D8(0x0004) (Edit, ExportObject, Component, EditInline)
	unsigned long                                      bActive : 1;                                              // 0x01DC(0x0004) (Net)
	struct FVector                                     VelocityForHoming;                                        // 0x01E0(0x000C)
	class UR_DamageTracking*                           DamageTracker;                                            // 0x01EC(0x0004)
	float                                              DamageTrackingExpireTime;                                 // 0x01F0(0x0004) (Const)
	float                                              DamageTrackingAssistTime;                                 // 0x01F4(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_BattleShipEngine");
		return ptr;
	}


	void SendOutDamageXPOnDeath();
	void TakeDamage(float DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	void TakeRadiusDamage(class AController* InstigatedBy, float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HurtOrigin, bool bFullDamage, class AActor* DamageCauser, float DamageFalloffExponent);
	void PostBeginPlay();
	unsigned char GetTeamNum();
	void OnSetActive();
	void ReplicatedEvent(const struct FName& VarName);
};


// Class HawkenGame.R_CustomServerConfig
// 0x0078 (0x024C - 0x01D4)
class AR_CustomServerConfig : public AInfo
{
public:
	struct FString                                     OwnerId;                                                  // 0x01D4(0x000C) (Transient, NeedCtorLink)
	class AR_MPGameBase*                               OwnerGame;                                                // 0x01E0(0x0004) (Transient)
	struct FString                                     ServerName;                                               // 0x01E4(0x000C) (NeedCtorLink)
	struct FString                                     GamePassword;                                             // 0x01F0(0x000C) (NeedCtorLink)
	struct FString                                     ServerAdminPassword;                                      // 0x01FC(0x000C) (NeedCtorLink)
	unsigned long                                      bEnableDeathCam : 1;                                      // 0x0208(0x0004)
	unsigned long                                      bAutoBalance : 1;                                         // 0x0208(0x0004)
	unsigned long                                      bSupportsMapCycle : 1;                                    // 0x0208(0x0004)
	unsigned long                                      bUseConfigMapCycle : 1;                                   // 0x0208(0x0004) (Transient)
	int                                                GoalScore;                                                // 0x020C(0x0004)
	int                                                DefaultGoalScore;                                         // 0x0210(0x0004) (Transient)
	int                                                TimeLimit;                                                // 0x0214(0x0004)
	int                                                DefaultTimeLimit;                                         // 0x0218(0x0004) (Transient)
	float                                              PreMatchTime;                                             // 0x021C(0x0004)
	int                                                MinPlayers;                                               // 0x0220(0x0004)
	int                                                MaxPlayers;                                               // 0x0224(0x0004)
	TArray<struct FString>                             MapCycle;                                                 // 0x0228(0x000C) (NeedCtorLink)
	TArray<struct FString>                             Mod;                                                      // 0x0234(0x000C) (NeedCtorLink)
	struct FString                                     ModParams;                                                // 0x0240(0x000C) (Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_CustomServerConfig");
		return ptr;
	}


	void UpdateGameInfo();
	void Setup(const struct FString& ServerID, class AR_MPGameBase* RGame);
};


// Class HawkenGame.R_DamageableActor
// 0x005C (0x0324 - 0x02C8)
class AR_DamageableActor : public AKActor
{
public:
	class UStaticMeshComponent*                        Mesh;                                                     // 0x02C8(0x0004) (Edit, ExportObject, Component, EditInline)
	class UStaticMesh*                                 DamagedMesh[0x4];                                         // 0x02CC(0x0004) (Edit)
	float                                              BumpCooldownTime;                                         // 0x02DC(0x0004) (Edit)
	int                                                BumpDamage;                                               // 0x02E0(0x0004) (Edit)
	int                                                CrushDamage;                                              // 0x02E4(0x0004) (Edit)
	class UParticleSystem*                             BumpEffect;                                               // 0x02E8(0x0004) (Edit)
	class UParticleSystem*                             BumpEffectSoft;                                           // 0x02EC(0x0004) (Edit)
	float                                              BumpEffectSoftVelocity;                                   // 0x02F0(0x0004) (Edit)
	class UParticleSystem*                             DamageEffect;                                             // 0x02F4(0x0004) (Edit)
	class USoundCue*                                   ImpactSound;                                              // 0x02F8(0x0004) (Edit)
	class USoundCue*                                   DamageSound;                                              // 0x02FC(0x0004) (Edit)
	class USoundCue*                                   DestroySound;                                             // 0x0300(0x0004) (Edit)
	float                                              DamageEffectScale;                                        // 0x0304(0x0004) (Edit)
	unsigned long                                      bDestroyable : 1;                                         // 0x0308(0x0004) (Edit)
	unsigned long                                      bDestroyOnBump : 1;                                       // 0x0308(0x0004) (Edit)
	unsigned long                                      bDestroyOnCrush : 1;                                      // 0x0308(0x0004) (Edit)
	class UParticleSystem*                             DestroyEffect;                                            // 0x030C(0x0004) (Edit)
	class UParticleSystem*                             DestroyEffectSecondary;                                   // 0x0310(0x0004) (Edit)
	float                                              DestroyEffectScale;                                       // 0x0314(0x0004) (Edit)
	int                                                HealthPerDamageLevel;                                     // 0x0318(0x0004) (Edit)
	int                                                Health;                                                   // 0x031C(0x0004)
	int                                                CurrentDestructionState;                                  // 0x0320(0x0004) (Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_DamageableActor");
		return ptr;
	}


	void UpdateDestructionState(int NewDestructionState);
	void Bump(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitNormal);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void DoCrushBump(class AActor* Other, const struct FVector& HitNormal);
	void BumpTimer();
	void TakeRadiusDamage(class AController* InstigatedBy, float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HurtOrigin, bool bFullDamage, class AActor* DamageCauser, float DamageFalloffExponent);
	void TakeDamage(float DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	void PostBeginPlay();
	void ReplicatedEvent(const struct FName& VarName);
};


// Class HawkenGame.R_DamageableStaticActor
// 0x0050 (0x0224 - 0x01D4)
class AR_DamageableStaticActor : public AActor
{
public:
	class UStaticMeshComponent*                        Mesh;                                                     // 0x01D4(0x0004) (Edit, ExportObject, Component, EditInline)
	class UStaticMesh*                                 DamagedMesh[0x4];                                         // 0x01D8(0x0004) (Edit)
	float                                              BumpCooldownTime;                                         // 0x01E8(0x0004) (Edit)
	int                                                BumpDamage;                                               // 0x01EC(0x0004) (Edit)
	int                                                CrushDamage;                                              // 0x01F0(0x0004) (Edit)
	class UParticleSystem*                             DamageEffect;                                             // 0x01F4(0x0004) (Edit)
	class USoundCue*                                   ImpactSound;                                              // 0x01F8(0x0004) (Edit)
	class USoundCue*                                   DamageSound;                                              // 0x01FC(0x0004) (Edit)
	class USoundCue*                                   DestroySound;                                             // 0x0200(0x0004) (Edit)
	float                                              DamageEffectScale;                                        // 0x0204(0x0004) (Edit)
	unsigned long                                      bDestroyable : 1;                                         // 0x0208(0x0004) (Edit)
	unsigned long                                      bDestroyOnBump : 1;                                       // 0x0208(0x0004) (Edit)
	unsigned long                                      bDestroyOnCrush : 1;                                      // 0x0208(0x0004) (Edit)
	class UParticleSystem*                             DestroyEffect;                                            // 0x020C(0x0004) (Edit)
	class UParticleSystem*                             DestroyEffectSecondary;                                   // 0x0210(0x0004) (Edit)
	float                                              DestroyEffectScale;                                       // 0x0214(0x0004) (Edit)
	int                                                HealthPerDamageLevel;                                     // 0x0218(0x0004) (Edit)
	int                                                Health;                                                   // 0x021C(0x0004)
	int                                                CurrentDestructionState;                                  // 0x0220(0x0004) (Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_DamageableStaticActor");
		return ptr;
	}


	void UpdateDestructionState(int NewDestructionState);
	void Bump(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitNormal);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void DoCrushBump(class AActor* Other, const struct FVector& HitNormal);
	void BumpTimer();
	void TakeRadiusDamage(class AController* InstigatedBy, float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HurtOrigin, bool bFullDamage, class AActor* DamageCauser, float DamageFalloffExponent);
	void TakeDamage(float DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	void PostBeginPlay();
	void ReplicatedEvent(const struct FName& VarName);
};


// Class HawkenGame.R_DamageType
// 0x0058 (0x00BC - 0x0064)
class UR_DamageType : public UDamageType
{
public:
	float                                              HitEffectScale;                                           // 0x0064(0x0004)
	unsigned long                                      IsRadiusDamage : 1;                                       // 0x0068(0x0004)
	unsigned long                                      IsTurret : 1;                                             // 0x0068(0x0004)
	unsigned long                                      IsBattleship : 1;                                         // 0x0068(0x0004)
	unsigned long                                      IsBaseDefense : 1;                                        // 0x0068(0x0004)
	unsigned long                                      CanKnockPlayer : 1;                                       // 0x0068(0x0004)
	unsigned long                                      CauseInstantExplosionOnDeath : 1;                         // 0x0068(0x0004)
	unsigned long                                      bDontHurtInstigator : 1;                                  // 0x0068(0x0004)
	unsigned long                                      bPlayTakeHitEffect : 1;                                   // 0x0068(0x0004) (Const)
	class USoundCue*                                   ImpactCockpitSound;                                       // 0x006C(0x0004)
	struct FString                                     R_DamageWeaponName;                                       // 0x0070(0x000C) (Const, Localized, NeedCtorLink)
	class UClass*                                      R_DamageWeaponClass;                                      // 0x007C(0x0004)
	struct FName                                       DamageStatsName;                                          // 0x0080(0x0008)
	struct FName                                       KillStatsName;                                            // 0x0088(0x0008)
	struct FName                                       AssistStatsName;                                          // 0x0090(0x0008)
	struct FName                                       DeathStatsName;                                           // 0x0098(0x0008)
	struct FName                                       SuicideStatsName;                                         // 0x00A0(0x0008)
	class UCameraAnim*                                 DamageCameraShake;                                        // 0x00A8(0x0004)
	float                                              DamageCameraShakeScale;                                   // 0x00AC(0x0004)
	TEnumAsByte<EDamageCategories>                     DamageCategory;                                           // 0x00B0(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00B1(0x0003) MISSED OFFSET
	class UParticleSystem*                             Override_MechActualHitEffect;                             // 0x00B4(0x0004)
	class UParticleSystem*                             Override_MechTakeHitEffect;                               // 0x00B8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_DamageType");
		return ptr;
	}


	struct FName STATIC_GetStatsName(const struct FName& StatType);
	void STATIC_IncrementSuicides(class AR_PlayerReplicationInfo* KilledPRI);
	void STATIC_IncrementDeaths(class AR_PlayerReplicationInfo* KilledPRI);
	void STATIC_IncrementAssists(class AR_PlayerReplicationInfo* AssistPRI);
	int STATIC_IncrementKills(class AR_PlayerReplicationInfo* KillerPRI);
	void STATIC_ScoreKill(class AR_PlayerReplicationInfo* KillerPRI, class AR_PlayerReplicationInfo* KilledPRI, class APawn* KilledPawn);
};


// Class HawkenGame.R_DmgType_Crushed
// 0x0000 (0x00BC - 0x00BC)
class UR_DmgType_Crushed : public UR_DamageType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_DmgType_Crushed");
		return ptr;
	}

};


// Class HawkenGame.R_DmgType_Fell
// 0x0000 (0x00BC - 0x00BC)
class UR_DmgType_Fell : public UR_DamageType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_DmgType_Fell");
		return ptr;
	}

};


// Class HawkenGame.R_DmgType_RepairTorch
// 0x0000 (0x00BC - 0x00BC)
class UR_DmgType_RepairTorch : public UR_DamageType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_DmgType_RepairTorch");
		return ptr;
	}

};


// Class HawkenGame.R_EnergySource
// 0x00D8 (0x02AC - 0x01D4)
class AR_EnergySource : public AActor
{
public:
	int                                                MaxEnergy;                                                // 0x01D4(0x0004) (Edit)
	float                                              CurrentEnergy;                                            // 0x01D8(0x0004)
	int                                                CurrentEnergyRep;                                         // 0x01DC(0x0004) (Net)
	float                                              EnergyRegenRate;                                          // 0x01E0(0x0004) (Edit)
	float                                              EnergyTransferRate;                                       // 0x01E4(0x0004) (Edit)
	float                                              DistanceToDrain;                                          // 0x01E8(0x0004) (Edit)
	float                                              EnergyTransferMultiplier[0x5];                            // 0x01EC(0x0004)
	float                                              LightChargePct[0x3];                                      // 0x0200(0x0004) (Edit)
	float                                              BeamSpawnCooldown;                                        // 0x020C(0x0004) (Edit)
	float                                              BeamSpawnCooldownEmpty;                                   // 0x0210(0x0004) (Edit)
	float                                              BeamMaxSpeed;                                             // 0x0214(0x0004) (Edit)
	float                                              BeamHomingStrength;                                       // 0x0218(0x0004) (Edit)
	struct FVector                                     BeamTargetAdjust;                                         // 0x021C(0x000C) (Edit)
	class UAudioComponent*                             AudioComponent;                                           // 0x0228(0x0004) (Edit, Const, ExportObject, EditConst, Component, EditInline)
	class UAudioComponent*                             DrainingAudioComponent;                                   // 0x022C(0x0004) (Edit, Const, ExportObject, EditConst, Component, EditInline)
	class USkeletalMeshComponent*                      GeneratorMesh;                                            // 0x0230(0x0004) (ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        ObjectiveAreaMesh;                                        // 0x0234(0x0004) (ExportObject, Component, EditInline)
	class UAnimNodeSequence*                           SpinState;                                                // 0x0238(0x0004)
	float                                              CurrentEnergyPercent;                                     // 0x023C(0x0004)
	class UMaterialInstanceConstant*                   BulbAlphaMaterialInstance;                                // 0x0240(0x0004) (Transient)
	class AR_Pawn*                                     TouchingPawns[0x3];                                       // 0x0244(0x0004) (Net)
	int                                                NumTouchingPawns;                                         // 0x0250(0x0004) (Net)
	int                                                NumBeamEffects;                                           // 0x0254(0x0004)
	class UParticleSystem*                             BeamCompPS;                                               // 0x0258(0x0004)
	class UParticleSystemComponent*                    BeamComp[0x3];                                            // 0x025C(0x0004) (ExportObject, Component, EditInline)
	class UParticleSystem*                             TopCompPS;                                                // 0x0268(0x0004)
	class UParticleSystemComponent*                    TopComp;                                                  // 0x026C(0x0004) (ExportObject, Component, EditInline)
	unsigned long                                      bTopEffectActive : 1;                                     // 0x0270(0x0004)
	class AR_Pawn*                                     AttractorEnabledPawns[0x3];                               // 0x0274(0x0004)
	class UParticleSystem*                             EnergyParticleSystem;                                     // 0x0280(0x0004)
	class UStaticMeshComponent*                        PaddleTemplate;                                           // 0x0284(0x0004) (ExportObject, Component, EditInline)
	struct FName                                       RotateBone;                                               // 0x0288(0x0008)
	TArray<struct FTransform>                          PaddleTransforms;                                         // 0x0290(0x000C) (NeedCtorLink)
	TArray<struct FTransform>                          EmitterTransforms;                                        // 0x029C(0x000C) (NeedCtorLink)
	class AEmitter*                                    GridActor;                                                // 0x02A8(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_EnergySource");
		return ptr;
	}


	void TransferEnergy(float DeltaTime);
	void PostBeginPlay();
	void ResetEnergy();
	void UpdateTopBeams(bool bReplenishing);
	void UpdateBeamEffects(bool bReplenishing);
	int GetNumDrainingPawns(bool bReplenishing);
	void UpdateChargeStateVisuals();
	void InitCustomizedMaterial();
	void Tick(float DeltaTime);
	void PostInitAnimTree(class USkeletalMeshComponent* SkelComp);
};


// Class HawkenGame.R_EventTracking
// 0x0000 (0x003C - 0x003C)
class UR_EventTracking : public UOnlineEventTracking
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class HawkenGame.R_EventTracking");
		return ptr;
	}


	void STATIC_SendEvent_PlayerFramerate(class AController* Player, float DeltaTime);
	void STATIC_SendEvent_OverflowXpToMechFailure(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int AmountTransferred, int MechTier, int MechTierHasXpFor, int MechXPAfterTransfer, int OverflowXpAfterTransfer);
	void STATIC_SendEvent_TransferredOverflowXpToMech(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int AmountTransferred, int MechTier, int MechTierHasXpFor, int MechXPAfterTransfer, int OverflowXpAfterTransfer);
	void STATIC_SendEvent_OverflowXpToPoolFailure(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int AmountTransferred, int MechXPAfterTransfer, int OverflowXpAfterTransfer, int mcPerIncrement, int XpPerIncrement);
	void STATIC_SendEvent_SentOverflowXpToPool(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int AmountTransferred, int MechXPAfterTransfer, int OverflowXpAfterTransfer, int mcPerIncrement, int XpPerIncrement);
	void STATIC_SendEvent_MechInternalSlotsUnlocked(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int MechTierThreshold);
	void STATIC_SendEvent_MechItemSlotsUnlocked(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int MechTierThreshold);
	void STATIC_SendEvent_MechOptimizationSlotsUnlocked(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int MechTierThreshold);
	void STATIC_SendEvent_MechItemRewarded(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int MechTierThreshold, const struct FString& ItemTypeGUID);
	void STATIC_SendEvent_MechItemUnlocked(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int MechTierThreshold, const struct FString& ItemTypeGUID);
	void STATIC_SendEvent_MechTierReached(class AController* Player, const struct FString& MechInstanceId, int MechType, int MechSubType, int MechTierThreshold, const struct FString& MechItemType, bool IsTestDrive);
	void STATIC_SendEvent_PilotTechGroupUnlocked(class AController* Player, int PilotLevelThreshold, int TechGroup, int TechLevel);
	void STATIC_SendEvent_PilotOptimizationPointsUnlocked(class AController* Player, int PilotLevelThreshold);
	void STATIC_SendEvent_PilotItemRewarded(class AController* Player, const struct FString& ItemTypeGUID, int PilotLevelThreshold);
	void STATIC_SendEvent_MatchmakingRequestPartyDeployCancelled(struct FUniqueNetId* PlayerID);
	void STATIC_SendEvent_MatchmakingRequestPartyDeployed(TArray<struct FUniqueNetId> PartyMemberGuids, const struct FString& ServerListingGuid, struct FUniqueNetId* PlayerID);
	void STATIC_SendEvent_MatchmakingRequestFulfilled(const struct FString& ServerListingGuid, struct FUniqueNetId* PlayerID);
	void STATIC_SendEvent_MatchmakingRequestFailed(struct FUniqueNetId* PlayerID);
	void STATIC_SendEvent_MatchmakingRequestCancelled(struct FUniqueNetId* PlayerID);
	void STATIC_SendEvent_MatchmakingRequestSent(const struct FString& Region, const struct FString& GameType, TArray<struct FUniqueNetId> PartyMemberGuids, struct FUniqueNetId* PlayerID);
	void STATIC_SendEvent_AutoRestockConsumable(class AController* Player, const struct FString& OfferId, TEnumAsByte<EInventoryItemType> ConsumableType, TEnumAsByte<ENetworkErrorCode> ErrorCode);
	void STATIC_SendEvent_MechSavedInGame(class APlayerController* Player, const struct FMechPreset& preset);
	void STATIC_SendEvent_MechSaved(class APlayerController* Player, const struct FMechPreset& preset);
	void STATIC_SendEvent_TestDriveMechPurchased(const struct FMechPreset& NewMechPreset, const struct FString& TestDriveItemtypeId, const struct FString& PurchaseLocation);
	void STATIC_SendEvent_OfferRented(class AController* Player, const struct FString& OfferId, class UOnlineGameItemInstanceCollection* RentedGameItemInstances, int MechType, int MechSubType, const struct FString& MechInstanceId);
	void STATIC_SendEvent_OfferPurchased(class AController* Player, const struct FString& OfferId, class UOnlineGameItemInstanceCollection* PurchasedGameItemInstances, int MechType, int MechSubType, const struct FString& MechInstanceId, const struct FString& MechItemType, bool IsTestDrive);
	void STATIC_SendEvent_ExitedGarage(class APlayerController* PC);
	void STATIC_SendEvent_EnteredGarage(class APlayerController* PC);
	void STATIC_SendEvent_TutorialSectionStopped(const struct FString& TutorialSectionName);
	void STATIC_SendEvent_TutorialSectionStarted(const struct FString& TutorialSectionName);
	void STATIC_SendEvent_TutorialCompleted(const struct FString& TutorialName);
	void STATIC_SendEvent_TutorialStarted(const struct FString& TutorialName);
	void STATIC_SendEvent_ConsumableUsed(class AController* Player, int ConsumableIndex, int CurrentWaveNumber, int ChargeCost, int PreUseNumCharges, float PlayerHealth);
	void STATIC_SendEvent_ItemUsed(class AController* Player, int itemIdx);
	struct FString STATIC_GetTriggeredConsumableTrackingName(int itemSlot);
	struct FString STATIC_GetPassiveConsumableTrackingName(int itemSlot);
	struct FString STATIC_GetItemTrackingName(int itemSlot);
	struct FMechPreset STATIC_GetMechPresetFromInstanceId(const struct FString& MechInstanceId, class AController* Player, bool bUsePRI);
	void STATIC_AddMechIdData(class UStormEventObject* eventObject, const struct FMechPreset& preset);
	void STATIC_AddBotInfo(class UStormEventObject* eventObject, class APlayerReplicationInfo* SubjectPRI, class APlayerReplicationInfo* TargetPRI, class APlayerReplicationInfo* BotOptionalPRI);
	struct FString STATIC_GetBotInfo(class APlayerReplicationInfo* BotPRI);
	struct FString STATIC_GetBotOrPlayerID(class APlayerReplicationInfo* PRI);
	struct FString STATIC_GetBotOrPlayerType(class APlayerReplicationInfo* PRI);
	void STATIC_SendEvent_NPCKillAssist(class AController* AssistPlayer, class APawn* Victim, const struct FString& NPCName);
	void STATIC_SendEvent_BotAssist(class AController* AssistPlayer, class AController* VictimPlayer, class AController* KillerPlayer, int Points, int CurrentWaveNumber);
	void STATIC_SendEvent_BotKill(class AController* KillerPlayer, class UClass* DamageType, class AController* VictimPlayer, int CurrentWaveNumber);
	void STATIC_SendEvent_UpgradePurchased(int CurrentWaveNumber, class AR_PRI_Coop* PRI, TEnumAsByte<ECoopUpgradeCategory> UpgradeType);
	void STATIC_SendEvent_WaveEnded(int CurrentWaveNumber, class AR_CoOp* Game);
	void STATIC_SendEvent_WaveStarted(int CurrentWaveNumber, class AR_CoOp* Game);
	void STATIC_SendEvent_Revived(class AController* ReviverPlayer, class AController* DeadPlayer, int CurrentWaveNumber, const struct FVector& ReviveLocation);
	void STATIC_SendEvent_UpdateReactorHealth_MA(int TeamIndex, int HealthAmount, int MaxHealth);
	void STATIC_SendEvent_MissileFired_CP(int TeamIndex, int SiloIndex, int VictimTeamIndex);
	void STATIC_SendEvent_ControlPointCaptured(int TeamIndex, int SiloIndex);
	void STATIC_SendEvent_AntiAirFired(int subjectTeamIndex, int targetHealth, float targetTavelPercent);
	void STATIC_SendEvent_BattleshipReachedEnemyBase(int TeamIndex, int subjectHealth, int turretsLeft);
	void STATIC_SendEvent_BattleshipDestroyed(int TeamIndex, float travelPercent, int numTurretsLeft);
	void STATIC_SendEvent_BattleshipLaunched(int TeamIndex, int BattleShipLevel, int BattleshipHealthMax, int TravelDistanceTotal);
	void STATIC_SendEvent_LeftMissileSiloRadius(class AController* Player, float teamControl);
	void STATIC_SendEvent_EnteredMissileSiloRadius(class AController* Player, float teamControl);
	void STATIC_SendEvent_LoggedInAsAdmin(class AController* Player);
	void STATIC_SendEvent_UnlockedAchievement(class AController* Player, class UOnlineAchievementObject* Achievement);
	void STATIC_SendEvent_BehavedSuspiciously(class AController* Player, const struct FString& HackType);
	void STATIC_SendEvent_SyncingAccountFailed(const struct FString& ErrorDetails);
	void STATIC_SendEvent_SyncingAccountCompleted();
	void STATIC_SendEvent_SyncingAccountStarted();
	void STATIC_SendEvent_TrackVideoSettings();
	void STATIC_SendEvent_ViewedEULAVersion(int Version);
	struct FString STATIC_ConvertAchievementTypeToString(TEnumAsByte<EOnlineAchievementType> Value);
	struct FString STATIC_ConvertGraphicsSettingToString(int Value);
	struct FString STATIC_ConvertJoinServerFromToString(TEnumAsByte<EJoinServerFrom> JoinServerFrom);
	void STATIC_SendEvent_ConnectionToServerFailed(const struct FString& ConnectionRequestId, TEnumAsByte<EOnlineServerConnectionStatus> ConnectionStatus, TEnumAsByte<EProgressMessageSubType> ConnectionFailureSubType, const struct FString& ErrorDetails);
	void STATIC_SendEvent_ConnectedToServer(const struct FString& ConnectionRequestId);
	void STATIC_SendEvent_CancelledConnectionToServer(const struct FString& ConnectionRequestId);
	void STATIC_SendEvent_ConnectingToServer(const struct FString& ConnectionRequestId, TEnumAsByte<EJoinServerFrom> JoinServerFrom);
	void STATIC_SendEvent_LeftAntiAirRadius(class AController* Player, float teamControl);
	void STATIC_SendEvent_EnteredAntiAirRadius(class AController* Player, float teamControl);
	void STATIC_SendEvent_MatchEndMechStatus(class APlayerReplicationInfo* PRI, int presetIndex);
	void STATIC_SendEvent_MechGainedXP(class AController* Player, int XPamount, TEnumAsByte<EExperiencePointEventType> EventType);
	void STATIC_SendEvent_PilotLeveledUp(class AController* Player, int NewPilotLevel, int PilotLevelXPThreshold);
	void STATIC_SendEvent_GainedXP(class AController* Player, int XPamount, TEnumAsByte<EExperiencePointEventType> EventType);
	struct FString STATIC_ConvertMeteorCreditEventTypeToString(TEnumAsByte<EHawkenPointEventType> EventType);
	void STATIC_SendEvent_GainedMC(int MCamount, TEnumAsByte<EHawkenPointEventType> EventType);
	void STATIC_SendEvent_GainedHP(class AR_PlayerReplicationInfo* RSubjectPRI, int HPamount, TEnumAsByte<EHawkenPointEventType> EventType);
	struct FString STATIC_ConvertExperiencePointEventTypeToString(TEnumAsByte<EExperiencePointEventType> EventType);
	struct FString STATIC_ConvertHawkenPointEventTypeToString(TEnumAsByte<EHawkenPointEventType> EventType);
	void STATIC_SendEvent_EnergyDropped(class AController* Player, int Amount);
	void STATIC_SendEvent_EnergyDelivered(class AController* Player, int Amount);
	void STATIC_SendEvent_EnergyCollected(class AController* Player, int Amount);
	void STATIC_SendEvent_PlayerOverheatingStopped(class AController* Player);
	void STATIC_SendEvent_PlayerOverheatingStarted(class AController* Player);
	void STATIC_SendEvent_PlayerHealed(class AController* Player, float Amount, float Time);
	void STATIC_SendEvent_PlayerSustainedDamage(class AController* DamagedPlayer, class AR_PawnNative* DamagedPawn, class AController* DamageCauser, float Amount, class UClass* DamageType);
	void STATIC_SendEvent_PlayerAssist(class AController* Player, class AController* VictimPlayer, class AR_Pawn* VictimPawn, class AController* KillerPlayer, int Points);
	void STATIC_SendEvent_PlayerKill(class AController* KillerPlayer, class UClass* DamageType, class AController* VictimPlayer, int MultiKillLevel, int KillStreak, bool bRevenge, bool bAvenger, bool bSavior);
	void STATIC_SendEvent_PlayerDied(class AController* DeadPlayer, class UClass* DamageType, class AController* KillerPlayer);
	void STATIC_AddWeaponName(const struct FString& Key, class UStormEventObject* eventObject, class UClass* DamageType);
	void STATIC_SendEvent_PlayerSpawned(class AController* Player);
	void STATIC_SendEvent_PeriodicPlayerUpdate(class APawn* Pawn);
