#pragma once

// Hawken (1.5.3.142579) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class BaseAI.ActionArea
// 0x000C (0x020C - 0x0200)
class AActionArea : public AVolume
{
public:
	TArray<class AFireSpot*>                           FireSpots;                                                // 0x0200(0x000C) (Const, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.ActionArea");
		return ptr;
	}

};


// Class BaseAI.AIEditorDataInterface
// 0x0000 (0x003C - 0x003C)
class UAIEditorDataInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.AIEditorDataInterface");
		return ptr;
	}


	bool IsBeingEdit();
	void SetBeingEdit(bool bIsBeingEdited);
	void LoadData(class UObject* TemplateOb);
	void SaveData(class UObject* TemplateOb);
};


// Class BaseAI.BaseAIController
// 0x01EC (0x0594 - 0x03A8)
class ABaseAIController : public AGameAIController
{
public:
	class UBTManager*                                  BehTreeMgr;                                               // 0x03A8(0x0004) (Const, Transient)
	class ABlackBoard*                                 MyBlackBoard;                                             // 0x03AC(0x0004) (Const, Transient)
	struct FName                                       DefaultBehavior;                                          // 0x03B0(0x0008)
	struct FName                                       DefaultBehaviorMP;                                        // 0x03B8(0x0008) (Const)
	class UBTTemplate*                                 DefaultBehaviorTreeTemplate;                              // 0x03C0(0x0004)
	class UBaseAIDefinition*                           BaseDef;                                                  // 0x03C4(0x0004) (Edit)
	TArray<float>                                      RangeDistance;                                            // 0x03C8(0x000C) (Transient, NeedCtorLink)
	unsigned long                                      bEnemyRange2D : 1;                                        // 0x03D4(0x0004)
	unsigned long                                      bHandleEnemyRangeUpdate : 1;                              // 0x03D4(0x0004)
	unsigned long                                      bSquadBasedEnemySelection : 1;                            // 0x03D4(0x0004)
	unsigned long                                      bEventOnTargetChange : 1;                                 // 0x03D4(0x0004)
	unsigned long                                      bAlwaysAssignEnemy : 1;                                   // 0x03D4(0x0004)
	unsigned long                                      bNavigationForced : 1;                                    // 0x03D4(0x0004) (Const)
	unsigned long                                      bAlwaysFaceTarget : 1;                                    // 0x03D4(0x0004)
	unsigned long                                      bAlwaysFaceWithChest : 1;                                 // 0x03D4(0x0004)
	unsigned long                                      bWantsToBeLeader : 1;                                     // 0x03D4(0x0004)
	unsigned long                                      bTargetAlternateLoc : 1;                                  // 0x03D4(0x0004)
	unsigned long                                      bLeadTarget : 1;                                          // 0x03D4(0x0004)
	unsigned long                                      bEnemyInfoValid : 1;                                      // 0x03D4(0x0004)
	unsigned long                                      bEnemyIsVisible : 1;                                      // 0x03D4(0x0004)
	unsigned long                                      bUsePerceptionHearing : 1;                                // 0x03D4(0x0004)
	unsigned long                                      bUseAimAttractors : 1;                                    // 0x03D4(0x0004)
	unsigned long                                      bForceFire : 1;                                           // 0x03D4(0x0004) (Edit)
	unsigned long                                      bForceFireWhenNoLOS : 1;                                  // 0x03D4(0x0004) (Edit)
	unsigned long                                      bForceDisableFire : 1;                                    // 0x03D4(0x0004) (Edit)
	unsigned long                                      bKismetLogicPause : 1;                                    // 0x03D4(0x0004)
	unsigned long                                      bKismetActionRunning : 1;                                 // 0x03D4(0x0004)
	unsigned long                                      bFallingBackToFormation : 1;                              // 0x03D4(0x0004) (Const)
	unsigned long                                      bCallOnPreNewEnemySet : 1;                                // 0x03D4(0x0004)
	unsigned long                                      bAllwaysCheckForPathToEnemyWhenNewEnemySet : 1;           // 0x03D4(0x0004)
	unsigned long                                      bDebugGunAim : 1;                                         // 0x03D4(0x0004) (Transient)
	float                                              NextAllowedSquadTargetAssignment;                         // 0x03D8(0x0004) (Transient)
	class ABaseAIPawn*                                 SquadAssignedTarget;                                      // 0x03DC(0x0004) (Transient)
	class UBTPersonalInstance*                         CurrentBT;                                                // 0x03E0(0x0004) (Transient)
	TArray<class UBTPersonalInstance*>                 SuspendedTreesStack;                                      // 0x03E4(0x000C) (Transient, NeedCtorLink)
	struct FName                                       UsedETQQueries[0x4];                                      // 0x03F0(0x0008)
	int                                                FailedQueryId;                                            // 0x0410(0x0004)
	float                                              CoverComfort;                                             // 0x0414(0x0004) (Transient)
	class ABaseAIPawn*                                 MyBaseAIPawn;                                             // 0x0418(0x0004)
	unsigned char                                      ForbiddenNavFlags;                                        // 0x041C(0x0001)
	TEnumAsByte<ETargetingRequest>                     PreferedTargetingMode;                                    // 0x041D(0x0001)
	TEnumAsByte<EBaseMoveMood>                         LogicalMoveMood;                                          // 0x041E(0x0001) (Const)
	TEnumAsByte<ELeaderFollowingMode>                  LeaderFollowingMode;                                      // 0x041F(0x0001)
	TEnumAsByte<EDistanceClass>                        TetherDistanceWhileFollowingLeader;                       // 0x0420(0x0001) (Config)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0421(0x0003) MISSED OFFSET
	TArray<class UAITickablePlugin*>                   TickablePlugins;                                          // 0x0424(0x000C) (Const, NeedCtorLink)
	class UPluginSquad*                                SquadPlugin;                                              // 0x0430(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UAIPluginMovement*                           MovementPlugin;                                           // 0x0434(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UClass*                                      MovementPluginClass;                                      // 0x0438(0x0004)
	class AActor*                                      AvoidedActor;                                             // 0x043C(0x0004) (Transient)
	class AActor*                                      TemporaryFocus;                                           // 0x0440(0x0004)
	struct FVector                                     LastSeenPos;                                              // 0x0444(0x000C)
	struct FVector                                     LastSeeingPos;                                            // 0x0450(0x000C)
	float                                              LastSeenTime;                                             // 0x045C(0x0004)
	float                                              TrackingReactionTime;                                     // 0x0460(0x0004)
	float                                              BaseTrackingReactionTime;                                 // 0x0464(0x0004)
	struct FVector                                     TrackedVelocity;                                          // 0x0468(0x000C)
	class APawn*                                       CurrentlyTrackedEnemy;                                    // 0x0474(0x0004)
	class APawn*                                       BlockedAimTarget;                                         // 0x0478(0x0004)
	float                                              LastIterativeCheck;                                       // 0x047C(0x0004)
	float                                              AimUpdateFrequency;                                       // 0x0480(0x0004)
	float                                              LastAimUpdateTime;                                        // 0x0484(0x0004)
	float                                              ErrorUpdateFrequency;                                     // 0x0488(0x0004)
	float                                              LastErrorUpdateTime;                                      // 0x048C(0x0004)
	float                                              CurrentAimError;                                          // 0x0490(0x0004)
	TArray<struct FEnemyPosition>                      SavedPositions;                                           // 0x0494(0x000C) (NeedCtorLink)
	float                                              DefaultStuckAdjustingMinMovementDeltaRequired;            // 0x04A0(0x0004) (Config)
	float                                              DefaultStuckAdjustingMinMovementDeltaRequiredSq;          // 0x04A4(0x0004)
	float                                              DefaultMinTimeDeltaInSecsBetweenStuckAdjustingTests;      // 0x04A8(0x0004) (Config)
	float                                              DefaultStuckMinNormalMovementDeltaRequired;               // 0x04AC(0x0004) (Config)
	float                                              DefaultStuckMinNormalMovementDeltaRequiredSq;             // 0x04B0(0x0004)
	float                                              DefaultMinTimeDeltaInSecsBetweenNormalMovementStuckTests; // 0x04B4(0x0004) (Config)
	float                                              MovingToEnemyStuckAdjustingMinMovementDeltaRequired;      // 0x04B8(0x0004) (Config)
	float                                              MovingToEnemyStuckAdjustingMinMovementDeltaRequiredSq;    // 0x04BC(0x0004)
	float                                              MovingToEnemyMinTimeDeltaInSecsBetweenStuckAdjustingTests;// 0x04C0(0x0004) (Config)
	float                                              MovingToEnemyStuckMinNormalMovementDeltaRequired;         // 0x04C4(0x0004) (Config)
	float                                              MovingToEnemyStuckMinNormalMovementDeltaRequiredSq;       // 0x04C8(0x0004)
	float                                              MovingToEnemyMinTimeDeltaInSecsBetweenNormalMovementStuckTests;// 0x04CC(0x0004) (Config)
	float                                              HidingFromEnemyStuckAdjustingMinMovementDeltaRequired;    // 0x04D0(0x0004) (Config)
	float                                              HidingFromEnemyStuckAdjustingMinMovementDeltaRequiredSq;  // 0x04D4(0x0004)
	float                                              HidingFromEnemyMinTimeDeltaInSecsBetweenStuckAdjustingTests;// 0x04D8(0x0004) (Config)
	float                                              HidingFromEnemyStuckMinNormalMovementDeltaRequired;       // 0x04DC(0x0004) (Config)
	float                                              HidingFromEnemyStuckMinNormalMovementDeltaRequiredSq;     // 0x04E0(0x0004)
	float                                              HidingFromEnemyMinTimeDeltaInSecsBetweenNormalMovementStuckTests;// 0x04E4(0x0004) (Config)
	float                                              MoveToFiringPositionStuckAdjustingMinMovementDeltaRequired;// 0x04E8(0x0004) (Config)
	float                                              MoveToFiringPositionStuckAdjustingMinMovementDeltaRequiredSq;// 0x04EC(0x0004)
	float                                              MoveToFiringPositionMinTimeDeltaInSecsBetweenStuckAdjustingTests;// 0x04F0(0x0004) (Config)
	float                                              MoveToFiringPositionStuckMinNormalMovementDeltaRequired;  // 0x04F4(0x0004) (Config)
	float                                              MoveToFiringPositionStuckMinNormalMovementDeltaRequiredSq;// 0x04F8(0x0004)
	float                                              MoveToFiringPositionMinTimeDeltaInSecsBetweenNormalMovementStuckTests;// 0x04FC(0x0004) (Config)
	float                                              WadneringStuckAdjustingMinMovementDeltaRequired;          // 0x0500(0x0004) (Config)
	float                                              WadneringStuckAdjustingMinMovementDeltaRequiredSq;        // 0x0504(0x0004)
	float                                              WadneringMinTimeDeltaInSecsBetweenStuckAdjustingTests;    // 0x0508(0x0004) (Config)
	float                                              WadneringStuckMinNormalMovementDeltaRequired;             // 0x050C(0x0004) (Config)
	float                                              WadneringStuckMinNormalMovementDeltaRequiredSq;           // 0x0510(0x0004)
	float                                              WadneringMinTimeDeltaInSecsBetweenNormalMovementStuckTests;// 0x0514(0x0004) (Config)
	float                                              Response_MinEnemySeenTime;                                // 0x0518(0x0004) (Config)
	float                                              Response_MinEnemyMemoryTime;                              // 0x051C(0x0004) (Config)
	float                                              Response_MinEnemyHearTime;                                // 0x0520(0x0004) (Config)
	float                                              Response_MinEnemyBeliefTime;                              // 0x0524(0x0004) (Config)
	float                                              Response_EnemyTooLongNoSeeTime;                           // 0x0528(0x0004) (Config)
	float                                              Response_MinEnemyDetectStartTime;                         // 0x052C(0x0004) (Config)
	float                                              Response_MinEnemyDetectFinishTime;                        // 0x0530(0x0004) (Config)
	float                                              Response_HearingLostTime;                                 // 0x0534(0x0004) (Config)
	float                                              NextTargetSelectionTime;                                  // 0x0538(0x0004) (Transient)
	float                                              TargetSelectionInterval;                                  // 0x053C(0x0004)
	class AActor*                                      FireTarget;                                               // 0x0540(0x0004)
	TArray<float>                                      AimHitChance;                                             // 0x0544(0x000C) (Config, NeedCtorLink)
	float                                              AimModBase;                                               // 0x0550(0x0004) (Config)
	float                                              AimModEvading;                                            // 0x0554(0x0004) (Config)
	struct FVector                                     AimOffset;                                                // 0x0558(0x000C)
	float                                              LastLOSUpdateTime;                                        // 0x0564(0x0004) (Transient)
	TArray<class AActor*>                              TargetList;                                               // 0x0568(0x000C) (NeedCtorLink)
	TArray<class AActor*>                              ProhibitedTargetList;                                     // 0x0574(0x000C) (NeedCtorLink)
	class ABaseAISquad*                                BaseSquad;                                                // 0x0580(0x0004) (Transient)
	TArray<struct FLocalEnemyInfo>                     LocalEnemyList;                                           // 0x0584(0x000C) (NeedCtorLink)
	float                                              NextPathToEnemyCheckTime;                                 // 0x0590(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.BaseAIController");
		return ptr;
	}


	void DrawEnemyPerception(class UCanvas* DrawCanvas);
	bool HasLOSToEnemy();
	struct FVector GetAimPoint(class AActor* Target);
	float AdjustAimError(float TargetDist, bool bInstantProj);
	bool IsPointInMyActionArea(const struct FVector& pos);
	void CreatePathForRoute(class ABaseAIRoute* BaseRoute, class UNavigationPath** outPath);
	bool FollowRoute(class UObject* MoveObserver, class ARoute* RouteToFollow, TEnumAsByte<EActionPriority> ActionPriority, TEnumAsByte<EBaseMoveMood> InMM, bool bInvCover, bool bStopAtEnd, class AActor* RotateAtEndToMatch, float AcceptableDistance);
	bool MoveToPoint(class UObject* MoveObserver, const struct FVector& InDestLocation, TEnumAsByte<EActionPriority> ActionPriority, TEnumAsByte<EBaseMoveMood> InMM, bool bAllowedToFire, bool bStopAtEnd, bool bDynamicMidPoint, bool bStickToNavmesh, float AcceptableDistance, class AActor* RotateAtEndToMatch, struct FVector* DestOffset, struct FVector* MidPointOffset);
	bool MoveToFiringPositionUponEnemy(class UObject* MoveObserver, TEnumAsByte<EActionPriority> ActionPriority, TEnumAsByte<EBaseMoveMood> InMM, float MaxMovementDeltaForMoveGoalDuringBeforeRePathNeeded, float MaxMovementDeltaForMoveGoalDuringFinalApprochBeforeRePathNeeded, bool bAllowedToFire, bool bStopAtEnd, float AcceptableDistance, struct FVector* InFirePosLocation);
	bool HideFromEnemy(class UObject* MoveObserver, class APawn* MoveGoal, TEnumAsByte<EActionPriority> ActionPriority, TEnumAsByte<EBaseMoveMood> InMM, float DistAwayFromEnemy, float MaxMovementDeltaForMoveGoalDuringBeforeRePathNeeded, float MaxMovementDeltaForMoveGoalDuringFinalApprochBeforeRePathNeeded, bool bAllowedToFire, bool bStopAtEnd);
	bool MoveToActor(class UObject* MoveObserver, class AActor* inActorGoal, TEnumAsByte<EActionPriority> ActionPriority, TEnumAsByte<EBaseMoveMood> InMM, bool bInAllowedToFire, bool bStopAtEnd, bool bStickToNavmesh, float AcceptableDistance, float MaxMovementDeltaForMoveGoalDuringBeforeRePathNeeded, float MaxMovementDeltaForMoveGoalDuringFinalApprochBeforeRePathNeeded, class AActor* RotateAtEndToMatch);
	bool AllowedToMove();
	void StopMovement(TEnumAsByte<EActionPriority> ActionPriority);
	struct FVector GetDesiredMoveTargetOffset();
	void StepAsideFor(class AActor* Other, const struct FVector& HitNormal);
	bool IsMovementLocked(TEnumAsByte<EActionPriority> Priority);
	bool IsMoving();
	bool IsPointReachable(const struct FVector& Point);
	void SetupPathfinding();
	bool ClearNavigation(class UNavigationHandle* Navigation, bool bForced);
	bool SetNavigation(class UNavigationHandle* Navigation, bool bForced);
	void NavMeshVolumeLeft(class UNavigationHandle* NavVolume);
	void NavMeshVolumeEntered(class UNavigationHandle* NavVolume);
	void OnGlobalPauseChanged(bool bPaused);
	void StopLogic(bool bByKismet);
	void RestartLogic(bool bByKismet);
	void ResumeLogic(bool bByKismet);
	void SuspendLogic(bool bByKismet);
	void BreakKismetLogicAndMovementLock();
	bool IsLogicSuspended();
	bool IsLogicRunning();
	bool IsControlledByKismet();
	bool IsTargetOverwhelmed(class APawn* Target);
	bool SelectTarget();
	bool SelectEnemy();
	void SetEnemy(class APawn* NewEnemy);
	bool SelectTargetInternal(bool bOnlyFromTargetList);
	void NotifyKilled(class AController* Killer, class AController* Killed, class APawn* KilledPawn, class UClass* DamageType);
	bool HasValidFireLaneToCurrentEnemy(bool bUseDefaultFireLane, struct FVector* ExtentOfFireLane);
	void NotifyEnemyBecameVisible(class APawn* VisibleEnemy, float TimeSinceLastVisible);
	void NotifyLostEnemyVisibility(class APawn* LostEnemy);
	void NoticedEnemy(class APawn* NewEnemy);
	bool IsTargetConcealed(class AActor* Target);
	bool IsEnemyVisible(class APawn* EnemyPawn, int* EnemyIdx);
	bool CanPawnBeSeenFrom(class ABaseAIPawn* Target, const struct FVector& FireSpot);
	void UpdateEnemyPerception(bool bSkipResponseDelay);
	TEnumAsByte<EBaseMoveMood> GetMoveMoodOverride();
	void SetLogicalMoveMoodOverride(TEnumAsByte<EBaseMoveMood> MoveMood);
	void SetLogicalMoveMood(TEnumAsByte<EBaseMoveMood> MoveMood);
	void OnPostTeleport(class USequenceAction* Action);
	void OnTeleport(class USeqAct_Teleport* Action);
	void OnAISetBT(class USeqAct_AISetBT* inAction);
	void OnAISetGoal(class USeqAct_AISetGoal* inAction);
	bool IsFriendly(class AController* TestPlayer);
	bool IsFriendlyPawn(class APawn* TestPlayer);
	void RemoveAllEnemies();
	void RemoveEnemy(class APawn* EnemyPawn);
	int BroadcastEnemyKnowledge(class APawn* EnemyPawn, TEnumAsByte<EWSPerceptionMode> Perception);
	bool IsSquadMember();
	class AController* GetSquadLeader();
	void SetCanCover(bool bEnable);
	bool IsInCover();
	bool CanCover();
	void Cleanup(bool bBeingDestroyed);
	void FreeBTETQQuery();
	bool IsThereValidPathToThisEnemy(class APawn* NewEnemy);
	class APawn* OnPreNewEnemySet(class APawn* OldEnemy, class APawn* NewEnemy);
	int GetLocalEnemyIndex(class APawn* EnemyToFind);
	void UpdateEnemyWeaponStates();
	void UpdateWeaponStates();
	TEnumAsByte<EWSBodyStatus> UpdateEnemyBodyState();
	void OnEnemyRangeUpdate(float NewDistanceSquare);
	TEnumAsByte<EWSSymbolicAngle> UpdateEnemyAngle();
	TEnumAsByte<EWSRangeClass> UpdateEnemyRange();
	TEnumAsByte<EBehaviorTag> GetBehaviorTag(bool bNoneIfSuspended);
	TEnumAsByte<EBTStatus> ExecuteBT(const struct FName& TreeName);
	void OnDeathFailsafe();
	void Destroyed();
	void PawnDied(class APawn* inPawn);
	void OnTargetChange(class AActor* NewTarget);
	void InitializeMovementStuckParams();
	void InitializeDefaultBehavior();
	void SetDefaultBehavior(const struct FName& NewDefaultBehavior);
	void UnPossess();
	void Possess(class APawn* inPawn, bool bVehicleTransition);
	void InitializeAIClass();
	void InitializeBlackBoard();
	void SetTeam(int inTeamIdx);
	void InitFromDef();
	void SetDefinition(class UBaseAIDefinition* Def);
	void PostBeginPlay();
	void Initialize();
	void GenerateAndSetNameForThisLittleKiller();
};


// Class BaseAI.BaseAIDefinition
// 0x000C (0x0048 - 0x003C)
class UBaseAIDefinition : public UObject
{
public:
	TArray<struct FETQNamedQueryOverride>              QueryOverrides;                                           // 0x003C(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.BaseAIDefinition");
		return ptr;
	}

};


// Class BaseAI.BaseAIGame
// 0x0000 (0x039C - 0x039C)
class ABaseAIGame : public AGameInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.BaseAIGame");
		return ptr;
	}


	void NotifyKilled(class AController* Killer, class AController* KilledPlayer, class APawn* KilledPawn, class UClass* DamageType);
};


// Class BaseAI.BaseAINativeTypes
// 0x0000 (0x003C - 0x003C)
class UBaseAINativeTypes : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.BaseAINativeTypes");
		return ptr;
	}

};


// Class BaseAI.BaseAITypes
// 0x0000 (0x003C - 0x003C)
class UBaseAITypes : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.BaseAITypes");
		return ptr;
	}

};


// Class BaseAI.BaseAIPlayerController
// 0x0120 (0x0728 - 0x0608)
class ABaseAIPlayerController : public APlayerController
{
public:
	float                                              MaxVisibleEnemyDistance;                                  // 0x0608(0x0004) (Config)
	unsigned char                                      VisibleEnemiesUsed;                                       // 0x060C(0x0001) (Config)
	unsigned char                                      UnknownData00[0x3];                                       // 0x060D(0x0003) MISSED OFFSET
	struct FShootingInfo                               GatheredShootingInfo;                                     // 0x0610(0x00FC) (Transient)
	class ABaseAISquad*                                BaseSquad;                                                // 0x070C(0x0004) (Transient)
	TArray<struct FPCVisibleEnemy>                     LastVisibleEnemies;                                       // 0x0710(0x000C) (Transient, AlwaysInit, NeedCtorLink)
	struct FVector                                     AverageVisibleEnemyLocation;                              // 0x071C(0x000C) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.BaseAIPlayerController");
		return ptr;
	}


	void UpdateEnemyVisibility();
	void PostBeginPlay();
	bool GetShootingLocationAverage(bool bGetAnyLocation, struct FVector* VectorResult);
	void GatherShootingInfo(const struct FVector& HitLocation, int Weight);
};


// Class BaseAI.BaseAISquad
// 0x0014 (0x01E8 - 0x01D4)
class ABaseAISquad : public AInfo
{
public:
	class AController*                                 Leader;                                                   // 0x01D4(0x0004) (Edit, EditConst)
	class AActor*                                      FormationCenter;                                          // 0x01D8(0x0004) (Edit, EditConst)
	unsigned long                                      bPlayerSquad : 1;                                         // 0x01DC(0x0004)
	unsigned long                                      bIsMP : 1;                                                // 0x01DC(0x0004)
	unsigned long                                      bSquadInCombat : 1;                                       // 0x01DC(0x0004) (Transient)
	float                                              NextEnemySelectionTimestamp;                              // 0x01E0(0x0004) (Transient)
	float                                              EnemySelectionInterval;                                   // 0x01E4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.BaseAISquad");
		return ptr;
	}


	bool UpdateEnemySelection();
	class ABaseAIPawn* GetSquadCenterPawn();
	bool GetSquadMembers(TArray<class ABaseAIPawn*>* Members);
	int GetSquadMemberCount();
	void UpdateLeader(class AController* inLeader);
	void EnemyPerceivedBy(class AController* Member, TEnumAsByte<EWSPerceptionMode> PerceptionType, class APawn* Enemy);
	bool NotifyKilled(class AController* Killer, class AController* Killed, class APawn* KilledPawn);
	void Destroyed();
	void PostBeginPlay();
};


// Class BaseAI.BaseAISubsystem
// 0x0080 (0x00C4 - 0x0044)
class UBaseAISubsystem : public UAISubsystem
{
public:
	struct FPointer                                    VfTable_FCallbackEventDevice;                             // 0x0044(0x0004) (Const, Native, NoExport)
	struct FPointer                                    VfTable_FTickableObject;                                  // 0x0048(0x0004) (Const, Native, NoExport)
	int                                                BoolPropFlags;                                            // 0x004C(0x0004) (Const)
	class UETQSystem*                                  ETQSys;                                                   // 0x0050(0x0004)
	class UBTManager*                                  BTMgr;                                                    // 0x0054(0x0004)
	class UMessageSystem*                              MsgSys;                                                   // 0x0058(0x0004)
	class UNavigationSystem*                           NavSys;                                                   // 0x005C(0x0004)
	class USightSystem*                                SightSys;                                                 // 0x0060(0x0004)
	class UAIDebugTool*                                AIDebug;                                                  // 0x0064(0x0004)
	class ASmartObjectReplicationActor*                SmartObjectReplication;                                   // 0x0068(0x0004) (Const)
	TArray<class USOHubComponent*>                     SmartObjects;                                             // 0x006C(0x000C) (Const, ExportObject, Component, NeedCtorLink, EditInline)
	TArray<class USOHubComponent*>                     InitPendingSmartObjects;                                  // 0x0078(0x000C) (Const, ExportObject, Component, NeedCtorLink, EditInline)
	TArray<class ACoverLink*>                          SpawnedCovers;                                            // 0x0084(0x000C) (Const, NeedCtorLink)
	TArray<class UAIAvoidanceComponent*>               AvoidanceComponents;                                      // 0x0090(0x000C) (Const, ExportObject, Component, NeedCtorLink, EditInline)
	TArray<class ABaseAISquad*>                        Squads;                                                   // 0x009C(0x000C) (Const, NeedCtorLink)
	TArray<int>                                        TeamSizes;                                                // 0x00A8(0x000C) (Const, NeedCtorLink)
	TArray<class AActor*>                              PotentialTargets;                                         // 0x00B4(0x000C) (Const, NeedCtorLink)
	unsigned long                                      bGlobalPaused : 1;                                        // 0x00C0(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.BaseAISubsystem");
		return ptr;
	}


	void Init();
	bool STATIC_IsGlobalPaused();
	void STATIC_SetGlobalPaused(bool bPaused);
	void STATIC_NotifyPotentialTargets(class ABaseAIController* AI);
	void STATIC_RegisterPotentialTarget(class AActor* Target);
	bool STATIC_ToggleAILogging();
	void STATIC_NotifyKilled(class AController* Killer, class AController* KilledController, class APawn* KilledPawn);
	void STATIC_SetBoolProp(TEnumAsByte<EAISysBoolProps> Prop, bool bValue);
	bool STATIC_GetBoolProp(TEnumAsByte<EAISysBoolProps> Prop);
	int STATIC_GetEnemyTeamsSize(unsigned char TeamID);
	int STATIC_GetTeamSize(unsigned char TeamID);
	void STATIC_DecreaseTeamSize(unsigned char TeamID);
	void STATIC_IncreaseTeamSize(unsigned char TeamID);
	float STATIC_AppSeconds();
	void STATIC_UnRegisterSquad(class ABaseAISquad* Squad);
	void STATIC_RegisterSquad(class ABaseAISquad* Squad);
	void STATIC_UnRegisterAvoidanceComponent(class UAIAvoidanceComponent* AvoidanceComponent);
	void STATIC_RegisterAvoidanceComponent(class UAIAvoidanceComponent* AvoidanceComponent);
	void STATIC_UnRegisterSpawnedCover(class ACoverLink* Cover);
	void STATIC_RegisterSpawnedCover(class ACoverLink* Cover);
	void STATIC_UnRegisterSmartObject(class USOHubComponent* SO);
	void STATIC_RegisterSmartObject(class USOHubComponent* SO);
	class UAIDebugTool* STATIC_GetAIDebugTool();
	class USightSystem* STATIC_GetSightSystem();
	class UNavigationSystem* STATIC_GetNavigationSystem();
	class UMessageSystem* STATIC_GetMessageSystem();
	class UBTManager* STATIC_GetBTManager();
	class UETQSystem* STATIC_GetETQSystem();
	class UBaseAISubsystem* STATIC_GetInstance();
};


// Class BaseAI.MessageSystem
// 0x005C (0x0098 - 0x003C)
class UMessageSystem : public UObject
{
public:
	struct FMultiMap_Mirror                            GlobalHooks;                                              // 0x003C(0x003C) (Native, Transient)
	struct FPointer                                    QueueHeads;                                               // 0x0078(0x0004) (Const, Native, Transient)
	struct FPointer                                    QueueTails;                                               // 0x007C(0x0004) (Const, Native, Transient)
	struct FScriptDelegate                             __MessageHookDelegate__Delegate;                          // 0x0080(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __MessageHandlerDelegate__Delegate;                       // 0x008C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.MessageSystem");
		return ptr;
	}


	void SendMessageClassClass(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, class UClass* Param1, class UClass* Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageClassObject(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, class UClass* Param1, class UObject* Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageClassFloat(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, class UClass* Param1, float Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageClassInt(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, class UClass* Param1, int Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageObjectClass(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, class UObject* Param1, class UClass* Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageObjectObject(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, class UObject* Param1, class UObject* Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageObjectFloat(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, class UObject* Param1, float Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageObjectInt(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, class UObject* Param1, int Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageFloatClass(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, float Param1, class UClass* Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageFloatObject(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, float Param1, class UObject* Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageFloatFloat(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, float Param1, float Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageFloatInt(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, float Param1, int Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageIntClass(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, int Param1, class UClass* Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageIntObject(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, int Param1, class UObject* Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageIntFloat(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, int Param1, float Param2, TEnumAsByte<EMessagePriority> Priority);
	void SendMessageIntInt(TEnumAsByte<EMessageID> Code, class UObject* Sender, class UObject* Receiver, int Param1, int Param2, TEnumAsByte<EMessagePriority> Priority);
	void DrawDebugInfo(class UCanvas* Canvas);
	class UMessageSystem* STATIC_GetInstance();
	void RemoveHooksFrom(class UObject* Owner);
	void RemoveScriptHook(TEnumAsByte<EMessageID> Code, const struct FScriptDelegate& Hook);
	void AddScriptHook(TEnumAsByte<EMessageID> Code, const struct FScriptDelegate& Hook);
	bool MessageHandlerDelegate(const struct FMsgData& Message);
	void MessageHookDelegate(const struct FMsgData& Message);
	void Broadcast(const struct FMsgData& Message, float Radius, const struct FVector& Origin);
	void SendFromTo(const struct FMsgData& Message, class UObject* Sender, class UObject* Receiver);
	void Send(const struct FMsgData& Message);
	class UObject* GetMessageReceiver(struct FMsgData* Message);
	class UObject* GetMessageSender(struct FMsgData* Message);
	class UClass* GetMessageParamClass(const struct FMsgData& Message, int ParamIdx);
	class UObject* GetMessageParamObject(const struct FMsgData& Message, int ParamIdx);
	float GetMessageParamFloat(const struct FMsgData& Message, int ParamIdx);
	int GetMessageParamInt(const struct FMsgData& Message, int ParamIdx);
	void SetMessageReceiver(class UObject* Receiver, struct FMsgData* Message);
	void SetMessageSender(class UObject* Sender, struct FMsgData* Message);
	void SetMessageParamClass(int ParamIdx, class UClass* Value, struct FMsgData* Message);
	void SetMessageParamObject(int ParamIdx, class UObject* Value, struct FMsgData* Message);
	void SetMessageParamFloat(int ParamIdx, float Value, struct FMsgData* Message);
	void SetMessageParamInt(int ParamIdx, int Value, struct FMsgData* Message);
};


// Class BaseAI.SeqAct_SetLeaderFollowingMode
// 0x000C (0x0108 - 0x00FC)
class USeqAct_SetLeaderFollowingMode : public USequenceAction
{
public:
	class AActor*                                      Leader;                                                   // 0x00FC(0x0004)
	TEnumAsByte<ELeaderFollowingMode>                  Mode;                                                     // 0x0100(0x0001) (Edit)
	TEnumAsByte<EDistanceClass>                        TetherDistance;                                           // 0x0101(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0102(0x0002) MISSED OFFSET
	unsigned long                                      bSetAsLeader : 1;                                         // 0x0104(0x0004)
	unsigned long                                      bBreakKismetMovementAndLogicLock : 1;                     // 0x0104(0x0004) (Edit)
	unsigned long                                      bAbortKismetMovementRequest : 1;                          // 0x0104(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.SeqAct_SetLeaderFollowingMode");
		return ptr;
	}


	int STATIC_GetObjClassVersion();
};


// Class BaseAI.SightSystem
// 0x0070 (0x00AC - 0x003C)
class USightSystem : public UObject
{
public:
	int                                                MaxPendingTests;                                          // 0x003C(0x0004)
	int                                                MaxSightTests;                                            // 0x0040(0x0004)
	TArray<struct FPendingSightInfo>                   PendingChecks;                                            // 0x0044(0x000C) (NeedCtorLink)
	class ABaseAIController*                           LastTestFrom;                                             // 0x0050(0x0004)
	struct FMap_Mirror                                 VisCache;                                                 // 0x0054(0x003C) (Const, Native)
	int                                                RemovalIndex;                                             // 0x0090(0x0004) (Const, Native, Transient)
	float                                              VisCleanupTime;                                           // 0x0094(0x0004) (Transient)
	float                                              VisCleanupInterval;                                       // 0x0098(0x0004) (Const)
	float                                              VisValidDuration;                                         // 0x009C(0x0004) (Const)
	int                                                VisCacheStatsFrame;                                       // 0x00A0(0x0004) (Transient)
	float                                              TickTimeLimit;                                            // 0x00A4(0x0004)
	int                                                VisCacheSize;                                             // 0x00A8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.SightSystem");
		return ptr;
	}


	bool TestValidFireLane(class AActor* TraceActor, bool bUseDefaultFireLane, struct FVector* FromLocation, struct FVector* ToLocation, struct FVector* ExtentOfFireLane, struct FImpactInfo* HitInfo);
	bool TestVisibility(const struct FVector& FromLocation, const struct FVector& ToLocation, class AActor* TraceActor, struct FImpactInfo* HitInfo);
};


// Class BaseAI.AIAvoidanceComponent
// 0x0004 (0x01DC - 0x01D8)
class UAIAvoidanceComponent : public UPrimitiveComponent
{
public:
	unsigned long                                      bEnabled : 1;                                             // 0x01D8(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.AIAvoidanceComponent");
		return ptr;
	}


	void SetEnabled(bool bEnable);
};


// Class BaseAI.AIAvoidanceConeComponent
// 0x0010 (0x01EC - 0x01DC)
class UAIAvoidanceConeComponent : public UAIAvoidanceComponent
{
public:
	float                                              ConeDistance;                                             // 0x01DC(0x0004) (Const)
	float                                              ConeDOT;                                                  // 0x01E0(0x0004) (Const)
	struct FColor                                      ConeColor;                                                // 0x01E4(0x0004) (Const)
	int                                                ConeSides;                                                // 0x01E8(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.AIAvoidanceConeComponent");
		return ptr;
	}


	void SetConeSize(float NewDistance, float NewDot);
};


// Class BaseAI.AIAvoidanceCylinderComponent
// 0x0008 (0x01E4 - 0x01DC)
class UAIAvoidanceCylinderComponent : public UAIAvoidanceComponent
{
public:
	float                                              CylinderHeight;                                           // 0x01DC(0x0004) (Const)
	float                                              CylinderRadius;                                           // 0x01E0(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.AIAvoidanceCylinderComponent");
		return ptr;
	}


	void SetCylinderSize(float NewRadius, float NewHeight);
};


// Class BaseAI.BaseAIVolume
// 0x0004 (0x0204 - 0x0200)
class ABaseAIVolume : public AVolume
{
public:
	unsigned long                                      bEnabled : 1;                                             // 0x0200(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.BaseAIVolume");
		return ptr;
	}

};


// Class BaseAI.NavigationPath
// 0x0138 (0x0174 - 0x003C)
class UNavigationPath : public UObject
{
public:
	TArray<struct FPathPoint>                          PathPoints;                                               // 0x003C(0x000C) (Const, AlwaysInit, NeedCtorLink)
	struct FPolyArray_Mirror                           PolysUsed;                                                // 0x0048(0x000C) (Const, Native)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0054(0x000C) MISSED OFFSET
	struct FBaseTransform                              Base;                                                     // 0x0060(0x0100) (Const)
	struct FVector                                     LocalDestination;                                         // 0x0160(0x000C) (Const)
	unsigned long                                      bDynamic : 1;                                             // 0x016C(0x0004) (Const)
	int                                                Version;                                                  // 0x0170(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.NavigationPath");
		return ptr;
	}


	void DrawPath(class UCanvas* Canvas, unsigned char R, unsigned char G, unsigned char B, bool bPersistent);
	struct FVector WorldToLocal(const struct FVector& InLocation);
	void SetRoute(TArray<struct FPathPoint> Route);
	struct FVector GetElementPos(int Index);
};


// Class BaseAI.NavigationSystem
// 0x0010 (0x004C - 0x003C)
class UNavigationSystem : public UObject
{
public:
	TArray<class UNavigationHandle*>                   NavigationHandles;                                        // 0x003C(0x000C) (NeedCtorLink)
	class UNavigationHandle*                           MainNavigationHandle;                                     // 0x0048(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.NavigationSystem");
		return ptr;
	}


	void TestFindAnchor(const struct FVector& Point, const struct FVector& Extent);
	void TestProjectPointToNavMesh(const struct FVector& Point);
	void ToggleNavExByActor(class AActor* Referencer, bool bEnabled, float AgentRadius);
	bool MarkNavPoly(int PolyRef);
	void CycleNavMeshRendering(class UNavigationHandle** ShownRecastActor, float* ShownRadius);
	bool STATIC_ProjectPointToNavMesh(const struct FVector& Point, const struct FVector& Extent, float MinWalkableZ, float HoverDistance, bool bReachable, struct FVector* ResultPos);
	float GetStraightPathLength(const struct FVector& Start, const struct FVector& End, class UNavigationHandle* NavOverride, struct FVector* Extent);
	bool DoesStraightPathExist(const struct FVector& Start, const struct FVector& End, class UNavigationHandle* NavOverride);
	bool DoesPathExist(const struct FVector& Start, const struct FVector& End, class UNavigationHandle* NavOverride, bool bIncludeDisabled);
	bool CreatePathForRoute(class ARoute* inRoute, class UNavigationHandle* NavOverride, class UNavigationPath** ResultingPath);
	bool FindPath(const struct FVector& Start, const struct FVector& End, class UNavigationHandle* NavOverride, class AActor* Walker, bool bStickToNavmesh, unsigned char ForbiddenNavFlags, const struct FVector& ForcedMidPoint, class AActor* AvoidedActor, float AvoidanceRadius, bool bGetAsCloseAsPossible, class UNavigationPath** ResultingPath);
	float GetDistanceToWall(const struct FVector& Point, class UNavigationHandle* NavOverride, const struct FVector& HitPos, const struct FVector& HitNormal, float Radius);
	bool IsPointOnNavMesh(const struct FVector& Point, class UNavigationHandle* NavOverride, bool bIncludeDisabled, struct FVector* Extent, struct FVector* PointOnNavMesh);
	bool GetPointInsideVolume(class AVolume* Vol, class UNavigationHandle* NavOverride, bool bRandomized, struct FVector* Point);
	void UnRegisterRecastActor(class UNavigationHandle* RCActor);
	void RegisterRecastActor(class UNavigationHandle* RCActor);
};


// Class BaseAI.NavLocation
// 0x0001 (0x01D9 - 0x01D8)
class ANavLocation : public AKeypoint
{
public:
	TEnumAsByte<ENavLocationMovementType>              MovementType;                                             // 0x01D8(0x0001) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.NavLocation");
		return ptr;
	}

};


// Class BaseAI.FireSpot
// 0x0007 (0x01E0 - 0x01D9)
class AFireSpot : public ANavLocation
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x01D9(0x0003) MISSED OFFSET
	float                                              LastUsageTimeStamp;                                       // 0x01DC(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.FireSpot");
		return ptr;
	}

};


// Class BaseAI.NavLocationLinked
// 0x0027 (0x0200 - 0x01D9)
class ANavLocationLinked : public ANavLocation
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x01D9(0x0003) MISSED OFFSET
	struct FPointer                                    VfTable_IEditorLinkSelectionInterface;                    // 0x01DC(0x0004) (Const, Native, NoExport)
	TArray<class ANavLocationLinked*>                  NextDestinations;                                         // 0x01E0(0x000C) (Edit, DuplicateTransient, NeedCtorLink)
	TEnumAsByte<ENavLinkType>                          NavFlag;                                                  // 0x01EC(0x0001) (Edit)
	unsigned char                                      RealNavFlag;                                              // 0x01ED(0x0001)
	unsigned char                                      UnknownData01[0x2];                                       // 0x01EE(0x0002) MISSED OFFSET
	unsigned long                                      bPlayersOnly : 1;                                         // 0x01F0(0x0004) (Edit)
	TArray<class ANavLocationLinked*>                  ConnectionsAlreadyAdded;                                  // 0x01F4(0x000C) (Transient, AlwaysInit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.NavLocationLinked");
		return ptr;
	}

};


// Class BaseAI.NavLocationRenderingComponent
// 0x0000 (0x01D8 - 0x01D8)
class UNavLocationRenderingComponent : public UPrimitiveComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.NavLocationRenderingComponent");
		return ptr;
	}

};


// Class BaseAI.NavMeshGeneratingInterface
// 0x0000 (0x003C - 0x003C)
class UNavMeshGeneratingInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.NavMeshGeneratingInterface");
		return ptr;
	}


	void GetAdditionalRecastRadius(TArray<float>* ActorRadius);
};


// Class BaseAI.NavMeshGeneratingVolume
// 0x0010 (0x0210 - 0x0200)
class ANavMeshGeneratingVolume : public AVolume
{
public:
	class UNavigationHandle*                           NavOwner;                                                 // 0x0200(0x0004) (Edit, Const, EditConst)
	TArray<float>                                      SupportedActorRadii;                                      // 0x0204(0x000C) (Edit, Const, Transient, EditConst, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.NavMeshGeneratingVolume");
		return ptr;
	}


	void UnTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
};


// Class BaseAI.NavMeshModifier
// 0x000C (0x020C - 0x0200)
class ANavMeshModifier : public AVolume
{
public:
	class UNavigationHandle*                           ExclusiveOwner;                                           // 0x0200(0x0004) (Edit)
	TEnumAsByte<ENavPolyArea>                          PolyAreaType;                                             // 0x0204(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0205(0x0003) MISSED OFFSET
	unsigned long                                      bInfluenceAllNavigation : 1;                              // 0x0208(0x0004) (Edit)
	unsigned long                                      bEnabled : 1;                                             // 0x0208(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.NavMeshModifier");
		return ptr;
	}


	bool ShouldSaveForCheckpoint();
	void ApplyCheckpointRecord(struct ANavMeshModifier_FCheckpointRecord* Record);
	void CreateCheckpointRecord(struct ANavMeshModifier_FCheckpointRecord* Record);
	void OnToggle(class USeqAct_Toggle* Action);
	void OnToggleNavPolys(class USeqAct_ToggleNavPolys* Action);
};


// Class BaseAI.NavMeshModifingInterface
// 0x0000 (0x003C - 0x003C)
class UNavMeshModifingInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.NavMeshModifingInterface");
		return ptr;
	}


	TEnumAsByte<ENavPolyArea> GetNavMeshModifingAreaType();
	struct FVector GetNavMeshModifingExtent();
};


// Class BaseAI.SeqAct_RePath
// 0x0000 (0x00FC - 0x00FC)
class USeqAct_RePath : public USequenceAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.SeqAct_RePath");
		return ptr;
	}

};


// Class BaseAI.SeqAct_ToggleNavPolys
// 0x0000 (0x00FC - 0x00FC)
class USeqAct_ToggleNavPolys : public USeqAct_Toggle
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.SeqAct_ToggleNavPolys");
		return ptr;
	}

};


// Class BaseAI.AIDebugTool
// 0x00BC (0x00F8 - 0x003C)
class UAIDebugTool : public UObject
{
public:
	int                                                Version;                                                  // 0x003C(0x0004) (Const)
	float                                              GameFrameTime;                                            // 0x0040(0x0004) (Transient)
	int                                                BTPersonalLogSize;                                        // 0x0044(0x0004)
	TArray<struct FString>                             BTPersonalLog;                                            // 0x0048(0x000C) (NeedCtorLink)
	struct FString                                     DebugDrawMode;                                            // 0x0054(0x000C) (Config, NeedCtorLink)
	class ABaseAIController*                           DebugTarget;                                              // 0x0060(0x0004)
	int                                                EntryToDisplay;                                           // 0x0064(0x0004)
	TArray<struct FName>                               Filters;                                                  // 0x0068(0x000C) (Transient, AlwaysInit, NeedCtorLink)
	TArray<struct FName>                               ColorCategories;                                          // 0x0074(0x000C) (NeedCtorLink)
	TArray<class AActor*>                              UnreachableActors;                                        // 0x0080(0x000C) (NeedCtorLink)
	int                                                DrawingFlags;                                             // 0x008C(0x0004)
	struct FETQDebugEntry                              CurrentETQLog;                                            // 0x0090(0x0010) (Transient, NeedCtorLink)
	TArray<struct FETQDebugEntry>                      ETQLogHistory;                                            // 0x00A0(0x000C) (AlwaysInit, NeedCtorLink)
	unsigned long                                      bLogETQ : 1;                                              // 0x00AC(0x0004)
	unsigned long                                      bLoadOldLogs : 1;                                         // 0x00AC(0x0004)
	class ABaseAIPawn*                                 PawnUnderCrosshair;                                       // 0x00B0(0x0004) (Transient)
	class AActor*                                      LoggingContext;                                           // 0x00B4(0x0004) (Transient)
	struct FMap_Mirror                                 Logs;                                                     // 0x00B8(0x003C) (Const, Native)
	float                                              TestBotsAccuracy;                                         // 0x00F4(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.AIDebugTool");
		return ptr;
	}


	void DumpNativeCallStack(class AActor* Actor, const struct FName& LogCategory);
	struct FVector GetActorEntryLocation(class AActor* inActor, int Index);
	void FlushETQHistory();
	void AddETQLog(const struct FString& QueryName, const struct FString& TestName, class AActor* Querier);
	void FlushUnreachableActors();
	void LogUnreachableActor(class AActor* inActor);
	void ClearHistoryColor();
	void ColorHistory(const struct FName& Filter);
	void ClearHistoryFilter();
	void SetHistoryFilter(const struct FName& Filter, bool bVal);
	void ToggleLogDrawingMode(TEnumAsByte<ELogDrawingMode> Mode);
	void DisplayNextEntry(int Count, int Direction);
	void SetContext(class AActor* Actor);
	void LogSpaceLine(class AActor* Actor, const struct FVector& Start, const struct FVector& End, TEnumAsByte<EDebugLineType> Type, const struct FString& Comment, const struct FName& Category);
	void Log(class AActor* Actor, const struct FString& LogText, const struct FName& LogCategory);
	void SetDebugTarget(class ABaseAIController* NewDebugTarget);
	void FlushLogs(const struct FString& DirName, class ABaseAIController* AI);
	bool LoadLogFile(const struct FString& Filename, bool bAppendMapName);
	void DrawLog(class UCanvas* Canvas, class AActor* Actor);
	void AddBTLogEntry(const struct FString& Entry);
};


// Class BaseAI.SeqAct_FlushAILog
// 0x0018 (0x0114 - 0x00FC)
class USeqAct_FlushAILog : public USequenceAction
{
public:
	struct FString                                     Reason;                                                   // 0x00FC(0x000C) (Edit, NeedCtorLink)
	struct FString                                     FolderName;                                               // 0x0108(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.SeqAct_FlushAILog");
		return ptr;
	}

};


// Class BaseAI.SeqAct_SRand
// 0x0000 (0x00FC - 0x00FC)
class USeqAct_SRand : public USequenceAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BaseAI.SeqAct_SRand");
		return ptr;
	}

};


// Class BaseAI.BaseAIPawn
// 0x0114 (0x0758 - 0x0644)
class ABaseAIPawn : public AUDKPawn
{
public:
	class ABaseWeapon*                                 BaseWeapon;                                               // 0x0644(0x0004) (Transient)
	class ABaseAIController*                           MyBaseAI;                                                 // 0x0648(0x0004) (Transient)
	TArray<struct FName>                               AimAttractors;                                            // 0x064C(0x000C) (NeedCtorLink)
	int                                                CurrentAimAttractor;                                      // 0x0658(0x0004) (Transient)
	struct FMovementProperties                         MovementProps;                                            // 0x065C(0x0004)
	TEnumAsByte<EAccuracyType>                         AimAccuracy;                                              // 0x0660(0x0001) (Edit)
	unsigned char                                      MyAIType;                                                 // 0x0661(0x0001) (Transient)
	unsigned char                                      LastTeamNum;                                              // 0x0662(0x0001)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0663(0x0001) MISSED OFFSET
	float                                              AimSpread_Miss;                                           // 0x0664(0x0004) (Config)
	float                                              AimSpread_Hit;                                            // 0x0668(0x0004) (Config)
	float                                              AimSpread_ModifierWhileNotRendered;                       // 0x066C(0x0004) (Config)
	unsigned long                                      bMakeWeaponSelfFiring : 1;                                // 0x0670(0x0004) (Transient)
	unsigned long                                      bIsEvading : 1;                                           // 0x0670(0x0004)
	unsigned long                                      bSuppressWeaponDamage : 1;                                // 0x0670(0x0004)
